[{"Id":1,"Name":"Угроза автоматического распространения вредоносного кода в грид-системе","Description":"Угроза заключается в возможности внедрения и запуска вредоносного кода от имени доверенного процесса на любом из ресурсных центров грид-системы и его автоматического распространения на все узлы грид-системы. \r\nДанная угроза обусловлена слабостями технологии грид-вычислений – высоким уровнем автоматизации при малой администрируемости грид-системы.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий легального пользователя грид-системы","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Ресурсные центры грид-системы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":2,"Name":"Угроза агрегирования данных, передаваемых в грид-системе","Description":"Угроза заключается в возможности раскрытия нарушителем защищаемой информации путём выявления задействованных в её обработке узлов, сбора, анализа и обобщения данных, перехватываемых в сети передачи данных грид-системы.\r\nДанная угроза обусловлена слабостью технологии грид-вычислений – использованием незащищённых каналов сети Интернет как транспортной сети грид-системы.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсил и средств, достаточных для компенсации чрезвычайной распределённости грид-заданий между узлами грид-системы;\r\nпривилегий, достаточных для перехвата трафика сети передачи данных между элементами (узлами) грид-системы","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевой трафик (ckeck)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":3,"Name":"Угроза анализа криптографических алгоритмов и их реализации","Description":"Угроза заключается в возможности выявления слабых мест в криптографических алгоритмах или уязвимостей в реализующем их программном обеспечении.\r\nДанная угроза обусловлена слабостями криптографических алгоритмов, а также ошибками в программном коде криптографических средств, их сопряжении с системой или параметрах их настройки.\r\nРеализация угрозы возможна в случае наличия у нарушителя сведений об применяемых в системе средствах шифрования, реализованных в них алгоритмах шифрования и параметрах их настройки","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Метаданные, системное программное обеспечение (check)","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":4,"Name":"Угроза аппаратного сброса пароля BIOS","Description":"Угроза заключается в возможности сброса паролей, установленных в BIOS/UEFI без прохождения процедуры авторизации в системе путём обесточивания микросхемы BIOS (съёма аккумулятора) или установки перемычки в штатном месте на системной плате (переключение «джампера»).\r\nДанная угроза обусловлена уязвимостями некоторых системных (материнских) плат – наличием механизмов аппаратного сброса паролей, установленных в BIOS/UEFI.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к системному блоку компьютера","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":5,"Name":"Угроза внедрения вредоносного кода в BIOS","Description":"Угроза заключается в возможности заставить BIOS/UEFI выполнять вредоносный код при каждом запуске компьютера, внедрив его в BIOS/UEFI путём замены микросхемы BIOS/UEFI или обновления программного обеспечения BIOS/UEFI на версию, уже содержащую вредоносный код.\r\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI и заменой чипсета BIOS/UEFI.\r\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера","Sources":[{"violator":0,"potential":0}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":6,"Name":"Угроза внедрения кода или данных","Description":"Угроза заключается в возможности внедрения нарушителем в дискредитируемую информационную систему или IoT-устройство вредоносного кода, который может быть в дальнейшем запущен «вручную» пользователями, автоматически при выполнении определённого условия (наступления определённой даты, входа пользователя в систему и т.п.) или с использованием аутентификационных данных, заданных «по умолчанию», а также в возможности несанкционированного внедрения нарушителем некоторых собственных данных для обработки в дискредитируемую информационную систему, фактически осуществив незаконное использование чужих вычислительных ресурсов, и блокирования работы устройства при выполнении определенных команд.\r\nДанная угроза обусловлена:\r\nналичием уязвимостей программного обеспечения;\r\nслабостями мер антивирусной защиты и разграничения доступа;\r\nналичием открытого Telnet-порта на IoT-устройстве (только для IoT-устройств).\r\nРеализация данной угрозы возможна:\r\nв случае работы дискредитируемого пользователя с файлами, поступающими из недоверенных источников;\r\nпри наличии у него привилегий установки программного обеспечения;\r\nв случае неизмененных владельцем учетных данных IoT-устройства (заводских пароля и логина)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":7,"Name":"Угроза воздействия на программы с высокими привилегиями","Description":"Угроза заключается в возможности повышения нарушителем своих привилегий в дискредитированной системе (получения привилегии дискредитированных программ) путём использования ошибок в программах и выполнения произвольного кода с их привилегиями.\r\nДанная угроза обусловлена слабостями механизма проверки входных данных и команд, а также мер по разграничению доступа.\r\nРеализация данной угрозы возможна при условиях:\r\nобладания дискредитируемой программой повышенными привилегиями в системе;\r\nосуществления дискредитируемой программой приёма входных данных от других программ или от пользователя;\r\nнарушитель имеет возможность осуществлять передачу данных к дискредитируемой программе","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Информационная система, виртуальная машина, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":8,"Name":"Угроза восстановления и/или повторного использования аутентификационной информации","Description":"Угроза заключается в возможности доступа к данным пользователя в результате подбора (например, путём полного перебора или перебора по словарю) аутентификационной информации дискредитируемой учётной записи пользователя в системе, а также путём перехвата и повторного использования хэша пароля, для восстановления сеанса.\r\nДанная угроза обусловлена следующими недостатками:\r\nзначительно меньшим объёмом данных хеш-кода аутентификационной информации по сравнению с ней самой (время подбора хеш-кодов меньше времени полного перебора аутентификационной информации); \r\nслабостями алгоритма расчёта хеш-кода, допускающими его повторное использование для выполнения успешной аутентификации.\r\nРеализация данной угрозы возможна с помощью специальных программных средств, а также в некоторых случаях – «вручную»","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, микропрограммное обеспечение, учётные данные пользователя","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":9,"Name":"Угроза восстановления предыдущей уязвимой версии BIOS","Description":"Угроза заключается в возможности осуществления вынужденного перехода на использование BIOS/UEFI, содержащей уязвимости.\r\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI.\r\nПри использовании технологии обновления BIOS/UEFI возможно возникновение следующей ситуации (условия, характеризующие ситуацию указаны в хронологическом порядке): \r\nна компьютере установлена некоторая версия BIOS/UEFI, для которой на момент её работы не известны уязвимости; \r\nв силу некоторых обстоятельств BIOS/UEFI проходит процедуру обновления, сохраняя при этом предыдущую версию BIOS/UEFI на случай «отката» системы; \r\nпубликуются данные о существовании уязвимостей в предыдущей версии BIOS/UEFI; \r\nпроисходит сбой в работе системы, в результате чего текущая (новая) версия BIOS/UEFI становится неработоспособной (например, нарушается её целостность);\r\nпользователь осуществляет штатную процедуру восстановления работоспособности системы – проводит «откат» системы к предыдущему работоспособному состоянию","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":10,"Name":"Угроза выхода процесса за пределы виртуальной машины","Description":"Угроза заключается в возможности запуска вредоносной программой собственного гипервизора, функционирующего по уровню логического взаимодействия ниже компрометируемого гипервизора.\r\nДанная угроза обусловлена уязвимостями программного обеспечения гипервизора, реализующего функцию изолированной программной среды для функционирующих в ней программ, а также слабостями инструкций аппаратной поддержки виртуализации на уровне процессора.\r\nРеализация данной угрозы приводит не только к компрометации гипервизора, но и запущенных в созданной им виртуальной среде средств защиты, а, следовательно, к их неспособности выполнять функции безопасности в отношении вредоносных программ, функционирующих под управлением собственного гипервизора","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Информационная система, сетевой узел, носитель информации, объекты файловой системы, учётные данные пользователя, образ виртуальной машины","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":11,"Name":"Угроза деавторизации санкционированного клиента беспроводной сети","Description":"Угроза заключается в возможности автоматического разрыва соединения беспроводной точки доступа с санкционированным клиентом беспроводной сети.\r\nДанная угроза обусловлена слабостью технологий сетевого взаимодействия по беспроводным каналам передачи данных – сведения о МАС-адресах беспроводных клиентов доступны всем участникам сетевого взаимодействия.\r\nРеализация данной угрозы возможна при условии подключения нарушителем к беспроводной сети устройства, МАС-адрес которого будет полностью совпадать с МАС-адресом дискредитируемого санкционированного клиента","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Сетевой узел","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":12,"Name":"Угроза деструктивного изменения конфигурации/среды окружения программ","Description":"Угроза заключается в возможности деструктивного программного воздействия на дискредитируемое приложение путём осуществления манипуляций с используемыми им конфигурационными файлами или библиотеками.\r\nДанная угроза обусловлена слабостями мер контроля целостности конфигурационных файлов или библиотек, используемых приложениями.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя прав осуществления записи в файловые объекты, связанные с конфигурацией/средой окружения программы, или возможности перенаправления запросов дискредитируемой программы от защищённых файловых объектов к ложным","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, метаданные, объекты файловой системы, реестр","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":13,"Name":"Угроза деструктивного использования декларированного функционала BIOS","Description":"Угроза заключается в возможности неправомерного использования декларированного функционала BIOS/UEFI для нарушения целостности информации, хранимой на внешних носителях информации и в оперативном запоминающем устройстве компьютера.\r\nДанная угроза обусловлена уязвимостями программного обеспечения BIOS/UEFI, предназначенного для тестирования и обслуживания компьютера (средств проверки целостности памяти, программного обеспечения управления RAID-контроллером и т.п.).\r\nРеализации данной угрозы может способствовать возможность обновления некоторых BIOS/UEFI без прохождения аутентификации","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":14,"Name":"Угроза длительного удержания вычислительных ресурсов пользователями","Description":"Угроза заключается в возможности ограничения нарушителем доступа конечных пользователей к вычислительному ресурсу за счёт принудительного удержания его в загруженном состоянии путём осуществления им многократного выполнения определённых деструктивных действий или эксплуатации уязвимостей программ, распределяющих вычислительные ресурсы между задачами. \r\nДанная угроза обусловлена слабостями механизмов балансировки нагрузки и распределения вычислительных ресурсов.\r\nРеализация угрозы возможна в случае, если у нарушителя имеется возможность делать запросы, которые в совокупности требуют больше времени на выполнение, чем запросы пользователя","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сетевой узел, носитель информации, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":15,"Name":"Угроза доступа к защищаемым файлам с использованием обходного пути","Description":"Угроза заключается в возможности получения нарушителем доступа к скрытым/защищаемым каталогам или файлам посредством различных воздействий на файловую систему (добавление дополнительных символов в указании пути к файлу; обращение к файлам, которые явно не указаны в окне приложения). \r\nДанная угроза обусловлена слабостями механизма разграничения доступа к объектам файловой системы.\r\nРеализация данной угрозы возможна при условиях:\r\nналичие у нарушителя прав доступа к некоторым объектам файловой системы;\r\nотсутствие проверки вводимых пользователем данных;\r\nналичие у дискредитируемой программы слишком высоких привилегий доступа к файлам, обработка которых не предполагается с её помощью","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":16,"Name":"Угроза доступа к локальным файлам сервера при помощи URL","Description":"Угроза заключается в возможности передачи нарушителем дискредитируемому браузеру запроса на доступ к файловой системе пользователя вместо URL-запроса. При этом браузер выполнит этот запрос с правами, которыми он был наделён при запуске, и передаст данные, полученные в результате выполнения этой операции, нарушителю.\r\nДанная угроза обусловлена слабостями механизма проверки вводимых пользователем запросов, который не делает различий между запросами на доступ к файловой системе и URL-запросами.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя привилегий на отправку запросов браузеру, функционирующему в дискредитируемой системе","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":17,"Name":"Угроза доступа/перехвата/изменения HTTP cookies","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемой информации (учётным записям пользователей, сертификатам и т.п.), содержащейся в cookies-файлах, во время их хранения или передачи, в режиме чтения (раскрытие конфиденциальности) или записи (внесение изменений для реализации угрозы подмены доверенного пользователя).\r\nДанная угроза обусловлена слабостями мер защиты cookies-файлов: отсутствием проверки вводимых данных со стороны сетевой службы, использующей cookies-файлы, а также отсутствием шифрования при передаче cookies-файлов.\r\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к cookies-файлам и отсутствии проверки целостности их значений со стороны дискредитируемого приложения","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":18,"Name":"Угроза загрузки нештатной операционной системы","Description":"Угроза заключается в возможности подмены нарушителем загружаемой операционной системы путём несанкционированного переконфигурирования в BIOS/UEFI пути доступа к загрузчику операционной системы.\r\nДанная угроза обусловлена слабостями технологий разграничения доступа к управлению BIOS/UEFI.\r\nРеализация данной угрозы возможна при условии доступности нарушителю следующего параметра настройки BIOS/UEFI – указания источника загрузки операционной системы","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":19,"Name":"Угроза заражения DNS-кеша","Description":"Угроза заключается в возможности перенаправления нарушителем сетевого трафика через собственный сетевой узел путём опосредованного изменения таблиц соответствия IP- и доменных имён, хранимых в DNS-сервере, за счёт генерации лавины возможных ответов на запрос DNS-сервера легальному пользователю или за счёт эксплуатации уязвимостей DNS-сервера. \r\nДанная угроза обусловлена слабостями механизмов проверки подлинности субъектов сетевого взаимодействия, а также уязвимостями DNS-сервера, позволяющими напрямую заменить DNS-кеш DNS-сервера.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя привилегий, достаточных для отправки сетевых запросов к DNS-серверу","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":20,"Name":"Угроза злоупотребления возможностями, предоставленными потребителям облачных услуг","Description":"Угроза заключается в возможности осуществления потребителем облачных услуг (нарушителем) рассылки спама, несанкционированного доступа к виртуальным машинам других потребителей облачных услуг или осуществления других деструктивных программных воздействий на различные системы с помощью арендованных ресурсов облачного сервера.\r\nДанная угроза обусловлена тем, что потребитель облачных услуг может устанавливать собственное программное обеспечение на облачный сервер.\r\nРеализация данной угрозы возможна путём установки и запуска потребителем облачных услуг вредоносного программного обеспечения на облачный сервер. Успешная реализация данной угрозы потребителем облачных услуг оказывает негативное влияние на репутацию поставщика облачных услуг","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Облачная система, виртуальная машина","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":21,"Name":"Угроза злоупотребления доверием потребителей облачных услуг","Description":"Угроза заключается в возможности нарушения (случайно или намеренно) защищённости информации потребителей облачных услуг внутренними нарушителями поставщика облачных услуг.\r\nДанная угроза обусловлена тем, что значительная часть функций безопасности переведена в сферу ответственности поставщика облачных услуг, а также невозможностью принятия потребителем облачных услуг мер защиты от действий сотрудников поставщика облачных услуг.\r\nРеализация данной угрозы возможна при условии того, что потребители облачных услуг не входят в состав организации, осуществляющей оказание данных облачных услуг (т.е. потребитель действительно передал поставщику собственную информацию для осуществления её обработки)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Облачная система","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":22,"Name":"Угроза избыточного выделения оперативной памяти","Description":"Угроза заключается в возможности выделения значительных ресурсов оперативной памяти для обслуживания запросов вредоносных программ и соответственного снижения объёма ресурсов оперативной памяти, доступных в системе для выделения в ответ на запросы программ легальных пользователей.\r\nДанная угроза обусловлена наличием слабостей механизма контроля выделения оперативной памяти различным программам.\r\nРеализация данной угрозы возможна при условии нахождения вредоносного программного обеспечения в системе в активном состоянии","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Аппаратное обеспечение, системное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":23,"Name":"Угроза изменения компонентов информационной (автоматизированной) системы","Description":"Угроза заключается в возможности получения нарушителем доступа к сети, файлам, внедрения закладок и т.п. путём несанкционированного изменения состава программных или аппаратных средств информационной системы, что в дальнейшем позволит осуществлять данному нарушителю (или другому - внешнему, обнаружившему несанкционированный канал доступа в систему) несанкционированные действия в данной системе.\r\nДанная угроза обусловлена слабостями мер контроля за целостностью аппаратной конфигурации информационной системы.\r\nРеализация данной угрозы возможна при условии успешного получения нарушителем необходимых полномочий в системе и возможности подключения дополнительного периферийного оборудования","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сервер, рабочая станция, виртуальная машина, системное программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":24,"Name":"Угроза изменения режимов работы аппаратных элементов компьютера","Description":"Угроза заключается в возможности изменения нарушителем режимов работы аппаратных элементов компьютера путём несанкционированного переконфигурирования BIOS/UEFI, что позволяет:\r\nза счёт изменения частоты системной шины, режима передачи данных по каналам связи и т.п. повлиять на общую производительность компьютера или вызвать сбои в его работе;\r\nза счёт понижения входного напряжения, отключения систем охлаждения временно обеспечить неработоспособность компьютера;\r\nза счёт задания недопустимых параметров работы устройств (порогового значения отключения устройства при перегреве, входного напряжения и т.п.) привести к физическому выходу из строя отдельных аппаратных элементов компьютера.\r\nДанная угроза обусловлена слабостями технологий разграничения доступа к управлению BIOS/UEFI.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение соответствующих параметров настройки BIOS/UEFI","Sources":[{"violator":0,"potential":0}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":25,"Name":"Угроза изменения системных и глобальных переменных","Description":"Угроза заключается в возможности осуществления нарушителем опосредованного деструктивного программного воздействия на некоторые программы или систему в целом путём изменения используемых дискредитируемыми программами единых системных и глобальных переменных.\r\nДанная угроза обусловлена слабостями механизма контроля доступа к разделяемой памяти, а также уязвимостями программных модулей приложений, реализующих контроль целостности внешних переменных.\r\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к системным и глобальным переменным и отсутствии проверки целостности их значений со стороны дискредитируемого приложения","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":26,"Name":"Угроза искажения XML-схемы","Description":"Угроза заключается в возможности изменения нарушителем алгоритма обработки информации приложениями, функционирующими на основе XML-схем, вплоть до приведения приложения в состояние \"отказ в обслуживании\", путём изменения XML-схемы, передаваемой между клиентом и сервером.\r\nДанная угроза обусловлена слабостями мер обеспечения целостности передаваемых при клиент-серверном взаимодействии данных, а также слабостями механизма сетевого взаимодействия открытых систем.\r\nРеализация данной угрозы возможна при условиях осуществления нарушителем успешного несанкционированного доступа к сетевому трафику, передаваемому между клиентом и сервером и отсутствии проверки целостности XML-схемы со стороны дискредитируемого приложения","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":27,"Name":"Угроза искажения вводимой и выводимой на периферийные устройства информации","Description":"Угроза заключается в возможности дезинформирования пользователей или автоматических систем управления путём подмены или искажения исходных данных, поступающих от датчиков, клавиатуры или других устройств ввода информации, а также подмены или искажения информации, выводимой на принтер, дисплей оператора или на другие периферийные устройства.\r\nДанная угроза обусловлена слабостями мер антивирусной защиты и контроля достоверности входных и выходных данных, а также ошибками, допущенными в ходе проведения специальных проверок аппаратных средств вычислительной техники.\r\nРеализация данной угрозы возможна при условии наличия в дискредитируемой информационной системе вредоносного программного обеспечения (например, виртуальных драйверов устройств) или аппаратных закладок","Sources":[{"violator":1,"potential":0},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":28,"Name":"Угроза использования альтернативных путей доступа к ресурсам","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемой информации в обход штатных механизмов с помощью нестандартных интерфейсов (в том числе доступа через командную строку в обход графического интерфейса).\r\nДанная угроза обусловлена слабостями мер разграничения доступа к защищаемой информации, слабостями фильтрации входных данных.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nвозможности ввода произвольных данных в адресную строку;\r\nсведений о пути к защищаемому ресурсу;\r\nвозможности изменения интерфейса ввода входных данных","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Сетевой узел, объекты файловой системы, прикладное программное обеспечение, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":29,"Name":"Угроза использования вычислительных ресурсов суперкомпьютера «паразитными» процессами","Description":"Угроза заключается в возможности существенного снижения производительности вычислительного поля суперкомпьютера и эффективности выполнения на нём текущих параллельных вычислений из-за потребления вычислительных ресурсов суперкомпьютера «паразитными» процессами («процессами-потомками» предыдущих заданий или процессами, запущенными вредоносным программным обеспечением).\r\nДанная угроза обусловлена слабостями мер очистки памяти от «процессов-потомков» завершённых заданий, а также процессов, запущенных вредоносным программным обеспечением.\r\nРеализация данной угрозы возможна при условии некорректного завершения выполненных задач или наличия вредоносных процессов в памяти суперкомпьютера в активном состоянии","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Вычислительные узлы суперкомпьютера","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":30,"Name":"Угроза использования информации идентификации/аутентификации, заданной по умолчанию","Description":"Угроза заключается в возможности прохождения нарушителем процедуры авторизации на основе полученной из открытых источников идентификационной и аутентификационной информации, соответствующей учётной записи «по умолчанию» дискредитируемого объекта защиты.\r\nДанная угроза обусловлена тем, что во множестве программных и программно-аппаратных средств производителями предусмотрены учётные записи «по умолчанию», предназначенные для первичного входа в систему. Более того, на многих устройствах идентификационная и аутентификационная информация может быть возвращена к заданной «по умолчанию» после проведения аппаратного сброса параметров системы (функция Reset).\r\nРеализация данной угрозы возможна при одном из следующих условий:\r\nналичие у нарушителя сведений о производителе/модели объекта защиты и наличие в открытых источниках сведений об идентификационной и аутентификационной информации, соответствующей учётной записи «по умолчанию» для объекта защиты;\r\nуспешное завершение нарушителем процедуры выявления данной информации в ходе анализа программного кода дискредитируемого объекта защиты","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":2}],"ImpactObject":"Средства защиты информации, системное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, программно-аппаратные средства со встроенными функциями защиты","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":31,"Name":"Угроза использования механизмов авторизации для повышения привилегий","Description":"Угроза заключается в возможности получения нарушителем доступа к данным и функциям, предназначенным для учётных записей с более высокими чем у нарушителя привилегиями, за счёт ошибок в параметрах настройки средств разграничения доступа. При этом нарушитель для повышения своих привилегий не осуществляет деструктивное программное воздействие на систему, а лишь использует существующие ошибки.\r\nДанная угроза обусловлена слабостями мер разграничения доступа к программам и файлам.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя каких-либо привилегий в системе","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":32,"Name":"Угроза использования поддельных цифровых подписей BIOS","Description":"Угроза заключается в возможности установки уязвимой версии обновления BIOS/UEFI или версии, содержащей вредоносное программное обеспечение, но имеющей цифровую подпись.\r\nДанная угроза обусловлена слабостями мер по контролю за благонадёжностью центров выдачи цифровых подписей.\r\nРеализация данной угрозы возможна при условии выдачи неблагонадёжным центром сертификации цифровой подписи на версию обновления BIOS/UEFI, содержащую уязвимости, или на версию, содержащую вредоносное программное обеспечение (т.е. при осуществлении таким центром подлога), а также подмены нарушителем доверенного источника обновлений","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":33,"Name":"Угроза использования слабостей кодирования входных данных","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного информационного воздействия на дискредитируемую систему путём манипулирования значениями входных данных и формой их предоставления (альтернативные кодировки, некорректное расширение файлов и т.п.).\r\nДанная угроза обусловлена слабостями механизма контроля входных данных. \r\nРеализация данной угрозы возможна при условиях:\r\nдискредитируемая система принимает входные данные от нарушителя;\r\nнарушитель обладает возможностью управления одним или несколькими параметрами входных данных","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":34,"Name":"Угроза использования слабостей протоколов сетевого/локального обмена данными","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к передаваемой в системе защищаемой информации за счёт деструктивного воздействия на протоколы сетевого/локального обмена данными в системе путём нарушения правил использования данных протоколов.\r\nДанная угроза обусловлена слабостями самих протоколов (заложенных в них алгоритмов), ошибками, допущенными в ходе реализации протоколов, или уязвимостями, внедряемыми автоматизированными средствами проектирования/разработки.\r\nРеализация данной угрозы возможна в случае наличия слабостей в протоколах сетевого/локального обмена данными","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":35,"Name":"Угроза использования слабых криптографических алгоритмов BIOS","Description":"Угроза заключается в сложности проверки реальных параметров работы и алгоритмов, реализованных в криптографических средствах BIOS/UEFI. При этом доверие к криптографической защите будет ограничено доверием к производителю BIOS.\r\nДанная угроза обусловлена сложностью использования собственных криптографических алгоритмов в программном обеспечении BIOS/UEFI.\r\nВозможность реализации данной угрозы снижает достоверность оценки реального уровня защищённости системы","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":36,"Name":"Угроза исследования механизмов работы программы","Description":"Угроза заключается в возможности проведения нарушителем обратного инжиниринга кода программы и дальнейшего исследования его структуры, функционала и состава в интересах определения алгоритма работы программы и поиска в ней уязвимостей.\r\nДанная угроза обусловлена слабостями механизма защиты кода программы от исследования.\r\nРеализация данной угрозы возможна в случаях:\r\nналичия у нарушителя доступа к исходным файлам программы;\r\nналичия у нарушителя доступа к дистрибутиву программы и отсутствия механизма защиты кода программы от исследования","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":37,"Name":"Угроза исследования приложения через отчёты об ошибках","Description":"Угроза заключается в возможности исследования нарушителем алгоритма работы дискредитируемого приложения и его предполагаемой структуры путём анализа генерируемых этим приложением отчётов об ошибках.\r\nДанная угроза обусловлена размещением защищаемой информации (или информации, обобщение которой может раскрыть защищаемые сведения о системе) в генерируемых отчётах об ошибках.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя доступа к отчётам об ошибках, генерируемых приложением, и наличия избыточности содержащихся в них данных","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":38,"Name":"Угроза исчерпания вычислительных ресурсов хранилища больших данных","Description":"Угроза заключается в возможности временного возникновения состояния типа «отказ в обслуживании» у хранилища больших данных.\r\nДанная угроза обусловлена постоянным трудно контролируемым заполнением занятого дискового пространства за счёт данных, непрерывно поступающих из различных информационных источников, и слабостями технологий доступа и хранения информации в хранилищах больших данных.\r\nРеализация данной угрозы возможна при условии мгновенного (текущего) превышения скорости передачи данных над скоростью их сохранения (в силу недостаточности пропускной способности канала связи или скорости выделения свободного пространства и сохранения на него поступающих данных) или при условии временного отсутствия свободного места в хранилище (в силу некорректного управления хранилищем или в результате осуществления нарушителем деструктивного программного воздействия на механизм контроля за заполнением хранилища путём изменения параметров или логики его работы)","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Информационная система","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":39,"Name":"Угроза исчерпания запаса ключей, необходимых для обновления BIOS","Description":"Угроза заключается в возможности нарушения (невозможности осуществления) процедуры обновления BIOS/UEFI при исчерпании запаса необходимых для её проведения ключей.\r\nДанная угроза обусловлена ограниченностью набора ключей, необходимых для обновления BIOS/UEFI.\r\nРеализация данной угрозы возможна путём эксплуатации уязвимостей средств обновления набора ключей, или путём использования нарушителем программных средств перебора ключей","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":40,"Name":"Угроза конфликта юрисдикций различных стран","Description":"Угроза заключается в возможности отказа в трансграничной передаче защищаемой информации в рамках оказания облачных услуг в соответствии с требованиями локального законодательства стран, резиденты которых участвуют в оказании облачных услуг.\r\nДанная угроза обусловлена тем, что в зависимости от особенностей законодательства различных стран, резиденты которых участвуют в оказании облачных услуг, при обеспечении информационной безопасности могут использоваться правовые меры различных юрисдикций.\r\nРеализация данной угрозы возможна при условии того, что на обеспечение информационной безопасности в ходе оказания облачных услуг накладываются правовые меры различных юрисдикций, противоречащих друг другу в ряде вопросов","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Облачная система","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":41,"Name":"Угроза межсайтового скриптинга","Description":"Угроза заключается в возможности внедрения нарушителем участков вредоносного кода на сайт дискредитируемой системы таким образом, что он будет выполнен на рабочей станции просматривающего этот сайт пользователя.\r\nДанная угроза обусловлена слабостями механизма проверки безопасности при обработке запросов и данных, поступающих от веб-сайта.\r\nРеализация угрозы возможна в случае, если клиентское программное обеспечение поддерживает выполнение сценариев, а нарушитель имеет возможность отправки запросов и данных в дискредитируемую систему","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":42,"Name":"Угроза межсайтовой подделки запроса","Description":"Угроза заключается в возможности отправки нарушителем дискредитируемому пользователю ссылки на содержащий вредоносный код веб-ресурс, при переходе на который автоматически будут выполнены неправомерные вредоносные действия от имени дискредитированного пользователя.\r\nДанная угроза обусловлена уязвимостями браузеров, которые позволяют выполнять действия без подтверждения или аутентификации со стороны дискредитируемого пользователя.\r\nРеализация угрозы возможна в случае, если дискредитируемый пользователь сохраняет аутентификационную информацию с помощью браузера","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":43,"Name":"Угроза нарушения доступности облачного сервера","Description":"Угроза заключается в возможности прекращения оказания облачных услуг всем потребителям (или группе потребителей) из-за нарушения доступности для них облачной инфраструктуры.\r\nДанная угроза обусловлена тем, что обеспечение доступности не является специфичным требованием безопасности информации для облачных технологий, и, кроме того, облачные системы реализованы в соответствии с сервис-ориентированным подходом.\r\nРеализация данной угрозы возможна при переходе одного или нескольких облачных серверов в состояние «отказ в обслуживании». Более того, способность динамически изменять объём предоставляемых потребителям облачных услуг может быть использована нарушителем для реализации угрозы. При этом успешно реализованная угроза в отношении всего лишь одного облачного сервиса позволит нарушить доступность всей облачной системы","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Облачная система, облачный сервер","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":44,"Name":"Угроза нарушения изоляции пользовательских данных внутри виртуальной машины","Description":"Угроза заключается в возможности нарушения безопасности пользовательских данных программ, функционирующих внутри виртуальной машины, вредоносным программным обеспечением, функционирующим вне виртуальной машины.\r\nДанная угроза обусловлена наличием уязвимостей программного обеспечения гипервизора, обеспечивающего изолированность адресного пространства, используемого для хранения пользовательских данных программ, функционирующих внутри виртуальной машины, от несанкционированного доступа со стороны вредоносного программного обеспечения, функционирующего вне виртуальной машины.\r\nРеализация данной угрозы возможна при условии успешного преодоления вредоносным программным кодом границ виртуальной машины не только за счёт эксплуатации уязвимостей гипервизора, но и путём осуществления такого воздействия с более низких (по отношению к гипервизору) уровней функционирования системы","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Виртуальная машина, гипервизор","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":45,"Name":"Угроза нарушения изоляции среды исполнения BIOS","Description":"Угроза заключается в возможности изменения параметров и (или) логики работы программного обеспечения BIOS/UEFI путём программного воздействия из операционной системы компьютера или путём несанкционированного доступа к каналу сетевого взаимодействия серверного сервис-процессора.\r\nДанная угроза обусловлена слабостями технологий разграничения доступа к BIOS/UEFI, его функциям администрирования и обновления, со стороны операционной системы или каналов связи.\r\nРеализация данной угрозы возможна:\r\nсо стороны операционной системы – при условии наличия BIOS/UEFI функционала обновления и (или) управления программным обеспечением BIOS/UEFI из операционной системы;\r\nсо стороны сети – при условии наличия у дискредитируемого серверного сервис-процессора достаточных привилегий для управления всей системой, включая модификацию BIOS/UEFI серверов системы, и дискредитируемого сервера","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":46,"Name":"Угроза нарушения процедуры аутентификации субъектов виртуального информационного взаимодействия","Description":"Угроза заключается в возможности подмены субъекта виртуального информационного взаимодействия, а также в возможности возникновения состояния неспособности осуществления такого взаимодействия.\r\nДанная угроза обусловлена наличием множества различных протоколов взаимной идентификации и аутентификации виртуальных, виртуализованных и физических субъектов доступа, взаимодействующих между собой в ходе передачи данных как внутри одного уровня виртуальной инфраструктуры, так и между её уровнями.\r\nРеализация данной угрозы возможна в случае возникновения ошибок при проведении аутентификации субъектов виртуального информационного взаимодействия","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, метаданные, учётные данные пользователя","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":47,"Name":"Угроза нарушения работоспособности грид-системы при нетипичной сетевой нагрузке","Description":"Угроза заключается в возможности значительного снижения производительности грид-системы, вплоть до временного нарушения её работоспособности при появлении нетипичной сетевой нагрузки (в т.ч. вызванной распределённой DoS-атакой, активностью других пользователей в сети и др.).\r\nДанная угроза обусловлена слабостью технологий грид-вычислений – производительность грид-системы имеет сильную зависимость от загруженности каналов связи, что является следствием максимальной территориальной распределённости вычислительного модуля грид-системы среди всех типов информационных систем.\r\nРеализация данной угрозы возможна при условии недостаточного контроля за состоянием отдельных узлов грид-системы со стороны диспетчера задач грид-системы","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Грид-система, сетевой трафик","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":48,"Name":"Угроза нарушения технологии обработки информации путём несанкционированного внесения изменений в образы виртуальных машин","Description":"Угроза заключается в возможности осуществления деструктивного программного воздействия на дискредитируемую систему или опосредованного деструктивного программного воздействия через неё на другие системы путём осуществления несанкционированного доступа к образам виртуальных машин.\r\nДанная угроза обусловлена слабостями мер разграничения доступа к образам виртуальных машин, реализованных в программном обеспечении виртуализации.\r\nРеализация данной угрозы может привести:\r\nк нарушению конфиденциальности защищаемой информации, обрабатываемой с помощью виртуальных машин, созданных на основе несанкционированно изменённых образов;\r\nк нарушению целостности программ, установленных на виртуальных машинах;\r\nк нарушению доступности ресурсов виртуальных машин;\r\nк созданию ботнета путём внедрения вредоносного программного обеспечения в образы виртуальных машин, используемые в качестве шаблонов (эталонные образы)","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Образ виртуальной машины, сетевой узел, сетевое программное обеспечение, виртуальная машина","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":49,"Name":"Угроза нарушения целостности данных кеша","Description":"Угроза заключается в возможности размещения нарушителем в кеше приложения (например, браузера) или службы (например, DNS или ARP) некорректных (потенциально опасных) данных таким образом, что до обновления кеша дискредитируемое приложение (или служба) будет считать эти данные корректными. \r\nДанная угроза обусловлена слабостями в механизме контроля целостности данных в кеше.\r\nРеализация данной угрозы возможна в условиях осуществления нарушителем успешного несанкционированного доступа к данным кеша и отсутствии проверки целостности данных в кеше со стороны дискредитируемого приложения (или службы)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":50,"Name":"Угроза неверного определения формата входных данных, поступающих в хранилище больших данных","Description":"Угроза заключается в возможности искажения информации, сохраняемой в хранилище больших данных, или отказа в проведении сохранения при передаче в него данных в некоторых форматах.\r\nДанная угроза обусловлена слабостями технологий определения формата входных данных на основе дополнительной служебной информации (заголовки файлов и сетевых пакетов, расширения файлов и т.п.), а также технологий адаптивного выбора и применения методов обработки мультиформатной информации в хранилищах больших данных.\r\nРеализация данной угрозы возможна при условии, что дополнительная служебная информация о данных по какой-либо причине не соответствует их фактическому содержимому, или в хранилище больших данных не реализованы методы обработки данных получаемого формата","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Хранилище больших данных, метаданные","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":51,"Name":"Угроза невозможности восстановления сессии работы на ПЭВМ при выводе из промежуточных состояний питания","Description":"Угроза заключается в возможности потери несохранённых данных, обрабатываемых в предыдущей сессии работы на компьютере, а также в возможности потери времени для возобновления работы на компьютере.\r\nДанная угроза обусловлена ошибками в реализации программно-аппаратных компонентов компьютера, связанных с обеспечением питания.\r\nРеализация данной угрозы возможна при условии невозможности выведения компьютера из промежуточных состояний питания («ждущего режима работы», «гибернации» и др.)","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Рабочая станция, носитель информации, системное программное обеспечение, метаданные, объекты файловой системы, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":52,"Name":"Угроза невозможности миграции образов виртуальных машин из-за несовместимости аппаратного и программного обеспечения","Description":"Угроза заключается в возможности возникновения у потребителя облачных услуг непреодолимых сложностей для смены поставщика облачных услуг из-за технических сложностей в реализации процедуры миграции образов виртуальных машин из облачной системы одного поставщика облачных услуг в систему другого.\r\nДанная угроза обусловлена тем, что каждый поставщик облачных услуг использует для реализации своей деятельности аппаратное и программное обеспечение различных производителей, часть которого может использовать специфические (для данного производителя) инструкции, протоколы, методы, схемы коммутации и другие особенности реализации своего функционала.\r\nРеализация данной угрозы возможна в случае несовместимости стандартных программных интерфейсов обмена данными (API) для реализации процедуры миграции образов виртуальных машин между различными поставщиками облачных услуг в одном или обоих направлениях.\r\nТакже данная угроза обуславливает ограничение возможности смены производителей аппаратного и программного обеспечения поставщиком облачных услуг, что может привести к нарушению целостности и доступности информации по вине поставщика облачных услуг","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Облачная инфраструктура, виртуальная машина, аппаратное обеспечение, системное программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":53,"Name":"Угроза невозможности управления правами пользователей BIOS","Description":"Угроза заключается в возможности неправомерного использования пользователями декларированного функционала BIOS/UEFI, ориентированного на администраторов.\r\nДанная угроза обусловлена слабостями технологий разграничения доступа (распределения прав) к функционалу BIOS/UEFI между различными пользователями и администраторами.\r\nРеализация данной угрозы возможна при условии физического доступа к терминалу и, при необходимости, к системному блоку компьютера","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":54,"Name":"Угроза недобросовестного исполнения обязательств поставщиками облачных услуг","Description":"Угроза заключается в возможности раскрытия или повреждения целостности поставщиком облачных услуг защищаемой информации потребителей облачных услуг, невыполнения требований к уровню качества (уровню доступности) предоставляемых потребителям облачных услуг доступа к их программам или иммигрированным в облако информационным системам.\r\nДанная угроза обусловлена невозможностью непосредственного контроля над действиями сотрудников поставщика облачных услуг со стороны их потребителей.\r\nРеализация данной угрозы возможна в случаях халатности со стороны сотрудников поставщика облачных услуг, недостаточности должностных и иных инструкций данных сотрудников, недостаточности мер по менеджменту и обеспечению безопасности облачных услуг и т.д.","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Информационная система, сервер, носитель информации, метаданные, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":55,"Name":"Угроза незащищённого администрирования облачных услуг","Description":"Угроза заключается в возможности осуществления опосредованного деструктивного программного воздействия на часть или все информационные системы, функционирующие в облачной среде, путём перехвата управления над облачной инфраструктурой через механизмы удалённого администрирования.\r\nДанная угроза обусловлена недостаточностью внимания, уделяемого контролю вводимых пользователями облачных услуг данных (в том числе аутентификационных данных), а также уязвимостями небезопасных интерфейсов обмена данными (API), используемых средствами удалённого администрирования.\r\nРеализация данной угрозы возможна в случае получения нарушителем аутентификационной информации (при их вводе в общественных местах) легальных пользователей, или эксплуатации уязвимостей в средствах удалённого администрирования","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Облачная система, рабочая станция, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":56,"Name":"Угроза некачественного переноса инфраструктуры в облако","Description":"Угроза заключается в возможности снижения реального уровня защищённости иммигрирующей в облако информационной системы из-за ошибок, допущенных при миграции в ходе преобразования её реальной инфраструктуры в облачную.\r\nДанная угроза обусловлена тем, что преобразование даже части инфраструктуры информационной системы в облачную зачастую требует проведения серьёзных изменений в такой инфраструктуре (например, в политиках безопасности и организации сетевого обмена данными).\r\nРеализация данной угрозы возможна в случае несовместимости программных и сетевых интерфейсов или несоответствий политик безопасности при осуществлении переноса информационной системы в облако","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Информационная система, иммигрированная в облако, облачная система","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":57,"Name":"Угроза неконтролируемого копирования данных внутри хранилища больших данных","Description":"Угроза заключается в сложности контроля за всеми автоматически создаваемыми копиями информации в хранилище больших данных из-за временной несогласованности данных операций.\r\nДанная угроза обусловлена осуществлением дублирования (дву- или многократного) данных на различных вычислительных узлах, входящих в состав хранилища больших данных, с целью повышения скорости доступа к этим данным при большом количестве запросов чтения/записи. При этом данная операция является внутренней функцией и «непрозрачна» для конечных пользователей и администраторов хранилища больших данных.\r\nРеализация данной угрозы возможна при условии недостаточности мер по контролю за автоматически создаваемыми копиями информации, применяемых в хранилище больших данных","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Хранилище больших данных, метаданные, защищаемые данные","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":58,"Name":"Угроза неконтролируемого роста числа виртуальных машин","Description":"Угроза заключается в возможности ограничения или нарушения доступности виртуальных ресурсов для конечных потребителей облачных услуг путём случайного или несанкционированного преднамеренного создания нарушителем множества виртуальных машин.\r\nДанная угроза обусловлена ограниченностью объёма дискового пространства, выделенного под виртуальную инфраструктуру, и слабостями технологий контроля процесса создания виртуальных машин.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на создание виртуальных машин в облачной инфраструктуре","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Облачная система, консоль управления облачной инфраструктурой, облачная инфраструктура","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":59,"Name":"Угроза неконтролируемого роста числа зарезервированных вычислительных ресурсов","Description":"Угроза заключается в возможности отказа легальным пользователям в выделении компьютерных ресурсов после осуществления нарушителем неправомерного резервирования всех свободных компьютерных ресурсов (вычислительных ресурсов и ресурсов памяти).\r\nДанная угроза обусловлена уязвимостями программного обеспечения уровня управления виртуальной инфраструктурой, реализующего функцию распределения компьютерных ресурсов между пользователями.\r\nРеализация данной угрозы возможна при условии успешного осуществления нарушителем несанкционированного доступа к программному обеспечению уровня управления виртуальной инфраструктурой, реализующему функцию распределения компьютерных ресурсов между пользователями","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сервер","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":60,"Name":"Угроза неконтролируемого уничтожения информации хранилищем больших данных","Description":"Угроза заключается в возможности удаления из хранилища некоторых обрабатываемых данных без уведомления конечного пользователя или администратора.\r\nДанная угроза обусловлена слабостями механизма автоматического удаления данных, не отвечающих определённым требованиям (предельный «срок жизни» в хранилище, конечная несогласованность с другими данными, создание копии в другом месте и т.п.).\r\nРеализация данной угрозы возможна при условии недостаточности реализованных в хранилище больших данных мер по контролю за автоматическим удалением данных","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Хранилище больших данных, метаданные, защищаемые данные","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":61,"Name":"Угроза некорректного задания структуры данных транзакции","Description":"Угроза заключается в возможности совершения нарушителем (клиентом базы данных) подлога путём прерывания транзакции или подмены идентификатора транзакции. В первом случае происходит неполное выполнение транзакции, а во втором – пользователь форсированно завершает транзакцию, изменяя её ID, и сообщая о том, что транзакция не была проведена, тем самым провоцируя повторное проведение транзакции.\r\nДанная угроза обусловлена слабостями механизма контроля непрерывности транзакций и целостности данных, передаваемых в ходе транзакции между базой данных и её клиентом","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Сетевой трафик, база данных, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":62,"Name":"Угроза некорректного использования прозрачного прокси-сервера за счёт плагинов браузера","Description":"Угроза заключается в возможности перенаправления или копирования обрабатываемых браузером данных через прозрачный прокси-сервер, подключённый к браузеру в качестве плагина.\r\nДанная угроза обусловлена слабостями механизма контроля доступа к настройкам браузера.\r\nРеализация возможна в случае успешного осуществления нарушителем включения режима использования прозрачного прокси-сервера в параметрах настройки браузера, например, в результате реализации угрозы межсайтового скриптинга","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":63,"Name":"Угроза некорректного использования функционала программного и аппаратного обеспечения","Description":"Угроза заключается в возможности использования декларированных возможностей программных и аппаратных средств определённым (нестандартным, некорректным) способом с целью деструктивного воздействия на информационную систему и обрабатываемую ею информацию.\r\nДанная угроза связана со слабостями механизма обработки данных и команд, вводимых пользователями.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя доступа к программным и аппаратным средствам","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":64,"Name":"Угроза некорректной реализации политики лицензирования в облаке","Description":"Угроза заключается в возможности отказа потребителям облачных услуг в удалённом доступе к арендуемому программному обеспечению (т.е. происходит потеря доступности облачной услуги SaaS) по вине поставщика облачных услуг.\r\nДанная угроза обусловлена недостаточностью проработки вопроса управления политиками лицензирования использования программного обеспечения различных производителей в облаке.\r\nРеализация данной угрозы возможна при условии, что политика лицензирования использования программного обеспечения основана на ограничении количества его установок или числа его пользователей, а созданные виртуальные машины с лицензируемым программным обеспечением использованы много раз","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":65,"Name":"Угроза неопределённости в распределении ответственности между ролями в облаке","Description":"Угроза заключается в возможности возникновения существенных разногласий между поставщиком и потребителем облачных услуг по вопросам, связанным с определением их прав и обязанностей в части обеспечения информационной безопасности.\r\nДанная угроза обусловлена отсутствием достаточного набора мер контроля за распределением ответственности между различными ролями в части владения данными, контроля доступа, поддержки облачной инфраструктуры и т. п.\r\nВозможность реализации данной угрозы повышается в случае использования облачных услуг, предоставляемых другими поставщиками (т.е. в случае использования схемы оказания облачных услуг с участием посредников)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":66,"Name":"Угроза неопределённости ответственности за обеспечение безопасности облака","Description":"Угроза заключается в возможности невыполнения ряда мер по защите информации как поставщиком облачных услуг, так и их потребителем.\r\nДанная угроза обусловлена отсутствием чёткого разделения ответственности в части обеспечения безопасности информации между потребителем и поставщиком облачных услуг.\r\nРеализация данной угрозы возможна при условии недостаточности документального разделения сфер ответственности между сторонами участвующими в оказании облачных услуг, а также отсутствия документального определения ответственности за несоблюдение требований безопасности","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Облачная система","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":67,"Name":"Угроза неправомерного ознакомления с защищаемой информацией","Description":"Угроза заключается в возможности неправомерного случайного или преднамеренного ознакомления пользователя с информацией, которая для него не предназначена, и дальнейшего её использования для достижения своих или заданных ему другими лицами (организациями) деструктивных целей.\r\nДанная угроза обусловлена уязвимостями средств контроля доступа, ошибками в параметрах конфигурации данных средств или отсутствием указанных средств.\r\nРеализация данной угрозы не подразумевает установку и использование нарушителем специального вредоносного программного обеспечения. При этом ознакомление может быть проведено путём просмотра информации с экранов мониторов других пользователей, с отпечатанных документов, путём подслушивания разговоров и др.","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Аппаратное обеспечение, носители информации, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":68,"Name":"Угроза неправомерного/некорректного использования интерфейса взаимодействия с приложением","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на API в целях реализации функций, изначально не предусмотренных дискредитируемым приложением (например, использование функций отладки из состава API).\r\nДанная угроза обусловлена наличием слабостей в механизме проверки входных данных и команд API, используемого программным обеспечением.\r\nРеализация данной угрозы возможна в условиях наличия у нарушителя доступа к API и отсутствия у дискредитируемого приложения механизма проверки вводимых данных и команд","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":69,"Name":"Угроза неправомерных действий в каналах связи","Description":"Угроза заключается в возможности внесения нарушителем изменений в работу сетевых протоколов путём добавления или удаления данных из информационного потока с целью оказания влияния на работу дискредитируемой системы или получения доступа к конфиденциальной информации, передаваемой по каналу связи.\r\nДанная угроза обусловлена слабостями сетевых протоколов, заключающимися в отсутствии проверки целостности и подлинности получаемых данных. \r\nРеализация данной угрозы возможна при условии осуществления нарушителем несанкционированного доступа к сетевому трафику","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":70,"Name":"Угроза непрерывной модернизации облачной инфраструктуры","Description":"Угроза заключается в возможности занесения в облачную систему уязвимостей и слабостей вместе с добавлением нового программного или аппаратного обеспечения. При этом система, рассматриваемая как защищённая на этапе ввода её в эксплуатацию, уже не может считаться таковой после её модернизации.\r\nДанная угроза обусловлена тем, что, во-первых, поставщики облачных услуг предоставляют возможность осуществления потребителем облачных услуг выбора и (или) изменения первоначального состава программного обеспечения облачной инфраструктуры в процессе оказания таких услуг, а, во-вторых, при интенсивном подключении новых потребителей модернизация облачной инфраструктуры может проходить несколько раз в год.\r\nРеализация данной угрозы возможна в случае, если срок до следующей модернизации не превышает срока проведения оценки соответствия системы требованиям безопасности в условиях отсутствия системы менеджмента облачных услуг и обеспечения их безопасности (системы облачного менеджмента)","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Облачная инфраструктура","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":71,"Name":"Угроза несанкционированного восстановления удалённой защищаемой информации","Description":"Угроза заключается в возможности осуществления прямого доступа (доступа с уровней архитектуры более низких по отношению к уровню операционной системы) к данным, хранящимся на машинном носителе информации, или восстановления данных по считанной с машинного носителя остаточной информации.\r\nДанная угроза обусловлена слабостями механизма удаления информации с машинных носителей – информация, удалённая с машинного носителя, в большинстве случаев может быть восстановлена.\r\nРеализация данной угрозы возможна при следующих условиях:\r\nудаление информации с машинного носителя происходило без использования способов (методов, алгоритмов) гарантированного стирания данных (например, физическое уничтожение машинного носителя информации);\r\nтехнологические особенности машинного носителя информации не приводят к гарантированному уничтожению информации при получении команды на стирание данных;\r\nинформация не хранилась в криптографически преобразованном виде","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Машинный носитель информации","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":72,"Name":"Угроза несанкционированного выключения или обхода механизма защиты от записи в BIOS","Description":"Угроза заключается в возможности внедрения в BIOS/UEFI вредоносного программного кода после ошибочного или злонамеренного выключения пользователем механизма защиты BIOS/UEFI от записи, а также в возможности установки неподписанного обновления в обход механизма защиты от записи в BIOS/UEFI.\r\nДанная угроза обусловлена слабостями мер по разграничению доступа к управлению механизмом защиты BIOS/UEFI от записи, а также уязвимостями механизма обновления BIOS/UEFI, приводящими к переполнению буфера.\r\nРеализация данной угрозы возможна в одном из следующих условий:\r\nвыключенном механизме защиты BIOS/UEFI от записи;\r\nуспешной эксплуатации нарушителем уязвимости механизма обновления BIOS/UEFI, приводящей к переполнению буфера","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":73,"Name":"Угроза несанкционированного доступа к активному и (или) пассивному виртуальному и (или) физическому сетевому оборудованию из физической и (или) виртуальной сети","Description":"Угроза заключается в возможности изменения вредоносными программами алгоритма работы программного обеспечения сетевого оборудования и (или) параметров его настройки путём эксплуатации уязвимостей программного и (или) микропрограммного обеспечения указанного оборудования.\r\nДанная угроза обусловлена ограниченностью функциональных возможностей (наличием слабостей) активного и (или) пассивного виртуального и (или) физического сетевого оборудования, входящего в состав виртуальной инфраструктуры, наличием у данного оборудования фиксированного сетевого адреса.\r\nРеализация данной угрозы возможна при условии наличия уязвимостей в программном и (или) микропрограммном обеспечении сетевого оборудования","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Сетевое оборудование, микропрограммное обеспечение, сетевое программное обеспечение, виртуальные устройства","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":74,"Name":"Угроза несанкционированного доступа к аутентификационной информации","Description":"Угроза заключается в возможности извлечения паролей, имён пользователей или других учётных данных из оперативной памяти компьютера или хищения (копирования) файлов паролей (в том числе хранящихся в открытом виде) с машинных носителей информации","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, объекты файловой системы, учётные данные пользователя, реестр, машинные носители информации","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":75,"Name":"Угроза несанкционированного доступа к виртуальным каналам передачи","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного перехвата трафика сетевых узлов, недоступных с помощью сетевых технологий, отличных от сетевых технологий виртуализации, путём некорректного использования таких технологий.\r\nДанная угроза обусловлена слабостями мер контроля потоков, межсетевого экранирования и разграничения доступа, реализованных в отношении сетевых технологий виртуализации (с помощью которых строятся виртуальные каналы передачи данных).\r\nРеализация данной угрозы возможна при наличии у нарушителя привилегий на осуществление взаимодействия с помощью сетевых технологий виртуализации","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Сетевое программное обеспечение, сетевой трафик, виртуальные устройства","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":76,"Name":"Угроза несанкционированного доступа к гипервизору из виртуальной машины и (или) физической сети","Description":"Угроза заключается в возможности приведения нарушителем всей (если гипервизор – один) или части (если используется несколько взаимодействующих между собой гипервизоров) виртуальной инфраструктуры в состояние «отказ в обслуживании» путём осуществления деструктивного программного воздействия на гипервизор из запущенных в созданной им виртуальной среде виртуальных машин, или осуществления воздействия на гипервизор через его подключение к физической вычислительной сети.\r\nДанная угроза обусловлена наличием множества разнообразных интерфейсов взаимодействия между гипервизором и виртуальной машиной и (или) физической сетью, уязвимостями гипервизора, а также уязвимостями программных средств и ограниченностью функциональных возможностей аппаратных средств, используемых для обеспечения его работоспособности.\r\nРеализация данной угрозы возможна в одном из следующих случаев:\r\nналичие у нарушителя привилегий, достаточных для осуществления деструктивного программного воздействия из виртуальных машин;\r\nналичие у гипервизора активного интерфейса взаимодействия с физической вычислительной сетью","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Гипервизор","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":77,"Name":"Угроза несанкционированного доступа к данным за пределами зарезервированного адресного пространства, в том числе выделенного под виртуальное аппаратное обеспечение","Description":"Угроза заключается в возможности нарушения вредоносной программой, функционирующей внутри виртуальной машины, целостности программного кода своей и (или) других виртуальных машин, функционирующих под управлением того же гипервизора, а также изменения параметров её (их) настройки.\r\nДанная угроза обусловлена наличием слабостей программного обеспечения гипервизора, обеспечивающего изолированность адресного пространства, используемого для хранения не только защищаемой информации и программного кода обрабатывающих её программ, но и программного кода, реализующего виртуальное аппаратное обеспечение (виртуальные устройства обработки, хранения и передачи данных), от несанкционированного доступа со стороны вредоносной программы, функционирующей внутри виртуальной машины.\r\nРеализация данной угрозы возможна при условии успешного осуществления несанкционированного доступа со стороны вредоносной программы, функционирующей внутри виртуальной машины, к данным, хранящимся за пределами зарезервированного под пользовательские данные адресного пространства данной виртуальной машины","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Сервер, рабочая станция, виртуальная машина, гипервизор, машинный носитель информации, метаданные","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":78,"Name":"Угроза несанкционированного доступа к защищаемым виртуальным машинам из виртуальной и (или) физической сети","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на виртуальные машины из виртуальной и (или) физической сети как с помощью стандартных (не виртуальных) сетевых технологий, так и с помощью сетевых технологий виртуализации.\r\nДанная угроза обусловлена наличием у создаваемых виртуальных машин сетевых адресов и возможностью осуществления ими сетевого взаимодействия с другими субъектами.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя сведений о сетевом адресе виртуальной машины, а также текущей активности виртуальной машины на момент осуществления нарушителем деструктивного программного воздействия","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Виртуальная машина","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":79,"Name":"Угроза несанкционированного доступа к защищаемым виртуальным машинам со стороны других виртуальных машин","Description":"Угроза заключается в возможности осуществления деструктивного программного воздействия на защищаемые виртуальные машины со стороны других виртуальных машин с помощью различных механизмов обмена данными между виртуальными машинами, реализуемых гипервизором и активированных в системе.\r\nДанная угроза обусловлена слабостями механизма обмена данными между виртуальными машинами и уязвимостями его реализации в конкретном гипервизоре.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий, достаточных для использования различных механизмов обмена данными между виртуальными машинами, реализованных в гипервизоре и активированных в системе","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Виртуальная машина","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":80,"Name":"Угроза несанкционированного доступа к защищаемым виртуальным устройствам из виртуальной и (или) физической сети","Description":"Угроза заключается в возможности удалённого осуществления нарушителем несанкционированного доступа к виртуальным устройствам из виртуальной и (или) физической сети с помощью различных сетевых технологий, используемых для осуществления обмена данными в системе, построенной с использованием технологий виртуализации.\r\nДанная угроза обусловлена наличием слабостей в сетевых программных интерфейсах гипервизоров, предназначенных для удалённого управления составом и конфигурацией виртуальных устройств, созданных (создаваемых) данными гипервизорами.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий достаточных для осуществления обмена данными в системе, построенной с использованием технологий виртуализации","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Виртуальные устройства хранения, обработки и передачи данных","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":81,"Name":"Угроза несанкционированного доступа к локальному компьютеру через клиента грид-системы","Description":"Угроза заключается в возможности выполнения нарушителем сетевого входа на узел грид-системы с правами одной из учётных записей, соответствующей программным процессам системы управления заданиями, с последующим получением доступа к закрытой части криптографических сертификатов, используемых для установления связи в грид-системе.\r\nДанная угроза обусловлена наличием уязвимостей в клиенте грид-системы (клиентского программного обеспечения, устанавливаемого в узлах грид-системы), эксплуатация которых позволяет нарушителю осуществлять операции чтения и записи в объектах локальной файловой системы компьютера, отправку сигналов программным процессам (включая сигналы прекращения работы), операции чтения и записи в память программных процессов, соответствующих связующему программному обеспечению и грид-заданиям, открытия сетевых соединений в локальных и внешних узлах грид-системы.\r\nРеализация данной угрозы возможна при условии внедрения вредоносного программного кода в систему управления заданиями. Фактически наличие в узле грид-системы неизвестного его владельцу программного обеспечения (клиента грид-системы), проводящего неизвестные вычисления, является «черным ящиком», через который (путём эксплуатации уязвимостей или программных закладок) нарушитель может осуществить противоправные действия по отношению к хранящейся в узле грид-системы защищаемой информации (личной информации владельца узла)","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Узлы грид-системы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":82,"Name":"Угроза несанкционированного доступа к сегментам вычислительного поля","Description":"Угроза заключается в возможности осуществления несанкционированного доступа нарушителя к исходным данным, промежуточным и окончательным результатам расчётов других пользователей суперкомпьютера, а также случайное или преднамеренное деструктивное воздействие процессов решения одних задач на процессы и результаты решения других вычислительных задач.\r\nДанная угроза обусловлена слабостями механизма разграничения доступа субъектов к сегментам вычислительных полей суперкомпьютера.\r\nРеализация данной угрозы возможна при выполнении задач различных пользователей суперкомпьютера на одном вычислительном поле суперкомпьютера","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Вычислительный узел суперкомпьютера","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":83,"Name":"Угроза несанкционированного доступа к системе по беспроводным каналам","Description":"Угроза заключается в возможности получения нарушителем доступа к ресурсам всей дискредитируемой информационной системы через используемые в ее составе беспроводные каналы передачи данных.\r\nДанная угроза обусловлена слабостями протоколов идентификации/аутентификации (таких как WEP, WPA и WPA2, AES), используемых для доступа к беспроводному оборудованию.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя специализированного программного обеспечения, реализующего функции эксплуатации уязвимостей протоколов идентификации/аутентификации беспроводных сетей, а также нахождения в точке приема сигналов дискредитируемой беспроводной сети","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, учётные данные пользователя, сетевой трафик, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":84,"Name":"Угроза несанкционированного доступа к системе хранения данных из виртуальной и (или) физической сети","Description":"Угроза заключается в возможности осуществления деструктивного программного воздействия на виртуальные устройства хранения данных и (или) виртуальные диски (являющиеся как сегментами виртуального дискового пространства, созданного отдельным виртуальным устройством, так и единым виртуальным дисковым пространством, созданным путём логического объединения нескольких виртуальных устройств хранения данных).\r\nДанная угроза обусловлена наличием слабостей применяемых технологий распределения информации по различным виртуальным устройствам хранения данных и (или) виртуальным дискам, а также слабостей технологии единого виртуального дискового пространства. Указанные слабости связаны с высокой сложностью алгоритмов обеспечения согласованности действий по распределению информации в рамках единого виртуального дискового пространства, а также взаимодействия с виртуальными и физическими каналами передачи данных для обеспечения работы в рамках одного дискового пространства.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя специальных программных средств, способных эксплуатировать слабости технологий, использованных при построении системы хранения данных (сетевых технологий, технологий распределения информации и др.)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Виртуальные устройства хранения данных, виртуальные диски","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":85,"Name":"Угроза несанкционированного доступа к хранимой в виртуальном пространстве защищаемой информации","Description":"Угроза заключается в возможности нарушения конфиденциальности информации, содержащейся в распределённых файлах, содержащих защищаемую информацию, путём восстановления данных распределённых файлов из их множества отдельных фрагментов с помощью программного обеспечения и информационных технологий по обработке распределённой информации.\r\nДанная угроза обусловлена тем, что в связи с применением множества технологий виртуализации, предназначенных для работы с данными (распределение данных внутри виртуальных и логических дисков, распределение данных между такими дисками, распределение данных между физическими и виртуальными накопителями единого дискового пространства, выделение областей дискового пространства в виде отдельных дисков и др.), практически все файлы хранятся в виде множества отдельных сегментов.\r\nРеализация данной угрозы возможна при условии недостаточности или отсутствия мер по обеспечению конфиденциальности информации, хранящейся на отдельных накопителях","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Носитель информации, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":86,"Name":"Угроза несанкционированного изменения аутентификационной информации","Description":"Угроза заключается в возможности осуществления неправомерного доступа нарушителем к аутентификационной информации других пользователей с помощью штатных средств операционной системы или специальных программных средств.\r\nДанная угроза обусловлена наличием слабостей мер разграничения доступа к информации аутентификации.\r\nРеализация данной угрозы может способствовать дальнейшему проникновению нарушителя в систему под учётной записью дискредитированного пользователя","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, объекты файловой системы, учётные данные пользователя, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":87,"Name":"Угроза несанкционированного использования привилегированных функций BIOS","Description":"Угроза заключается в возможности использования нарушителем потенциально опасных возможностей BIOS/UEFI.\r\nДанная угроза обусловлена наличием в BIOS/UEFI потенциально опасного функционала","Sources":[{"violator":1,"potential":0},{"violator":0,"potential":2}],"ImpactObject":"Аппаратное обеспечение, микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":88,"Name":"Угроза несанкционированного копирования защищаемой информации","Description":"Угроза заключается в возможности неправомерного получения нарушителем копии защищаемой информации путём проведения последовательности неправомерных действий, включающих: несанкционированный доступ к защищаемой информации, копирование найденной информации на съёмный носитель (или в другое место, доступное нарушителю вне системы).\r\nДанная угроза обусловлена слабостями механизмов разграничения доступа к защищаемой информации и контроля доступа лиц в контролируемой зоне.\r\nРеализация данной угрозы возможна в случае отсутствия криптографических мер защиты или снятия копии в момент обработки защищаемой информации в нешифрованном виде","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Объекты файловой системы, машинный носитель информации","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":89,"Name":"Угроза несанкционированного редактирования реестра","Description":"Угроза заключается в возможности внесения нарушителем изменений в используемый дискредитируемым приложением реестр, которые влияют на функционирование отдельных сервисов приложения или приложения в целом. При этом под реестром понимается не только реестр операционной системы Microsoft Windows, а любой реестр, используемый приложением. Изменение реестра может быть как этапом при осуществлении другого деструктивного воздействия, так и основной целью.\r\nДанная угроза обусловлена слабостями механизма контроля доступа, заключающимися в присвоении реализующим его программам слишком высоких привилегий при работе с реестром.\r\nРеализация данной угрозы возможна в случае получения нарушителем прав на работу с программой редактирования реестра","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, использующее реестр, реестр","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":90,"Name":"Угроза несанкционированного создания учётной записи пользователя","Description":"Угроза заключается в возможности создания нарушителем в системе дополнительной учётной записи пользователя и её дальнейшего использования в собственных неправомерных целях (входа в систему с правами этой учётной записи и осуществления деструктивных действий по отношению к дискредитированной системе или из дискредитированной системы по отношению к другим системам).\r\nДанная угроза обусловлена слабостями механизмов разграничения доступа к защищаемой информации.\r\nРеализация данной угрозы возможна в случае наличия и прав на запуск специализированных программ для редактирования файлов, содержащих сведения о пользователях системы (при удалённом доступе) или штатных средств управления доступом из состава операционной системы (при локальном доступе)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":91,"Name":"Угроза несанкционированного удаления защищаемой информации","Description":"Угроза заключается в возможности причинения нарушителем экономического, информационного, морального и других видов ущерба собственнику и оператору неправомерно удаляемой информации путём осуществления деструктивного программного или физического воздействия на машинный носитель информации.\r\nДанная угроза обусловлена недостаточностью мер по обеспечению доступности защищаемой информации в системе, а равно и наличием уязвимостей в программном обеспечении, реализующим данные меры.\r\nРеализация данной угрозы возможна в случае получения нарушителем системных прав на стирание данных или физического доступа к машинному носителю информации на расстояние, достаточное для оказания эффективного деструктивного воздействия","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Метаданные, объекты файловой системы, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":92,"Name":"Угроза несанкционированного удалённого внеполосного доступа к аппаратным средствам","Description":"Угроза заключается в возможности получения нарушителем привилегий управления системой путём использования удалённого внеполосного (по независимому вспомогательному каналу TCP/IP) доступа.\r\nДанная угроза обусловлена невозможностью контроля за механизмом, реализующего функции удалённого доступа на аппаратном уровне, на уровне операционной системы, а также независимостью от состояния питания аппаратных устройств, т.к. данный механизм предусматривает процедуру удалённого включения/выключения аппаратных устройств.\r\nРеализация данной угрозы возможна в условиях:\r\nналичия в системе аппаратного обеспечения, поддерживающего технологию удалённого внеполосного доступа;\r\nналичия подключения системы к сетям общего пользования (сети Интернет)","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Информационная система, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":93,"Name":"Угроза несанкционированного управления буфером","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к данным, содержащимся в буфере обмена, в интересах ознакомления с хранящейся там информацией или осуществления деструктивного программного воздействия на систему (например, переполнение буфера для выполнения произвольного вредоносного кода).\r\nДанная угроза обусловлена слабостями в механизме разграничения доступа к буферу обмена, а также слабостями в механизмах проверки вводимых данных.\r\nРеализация данной угрозы возможна в случае осуществления нарушителем успешного несанкционированного доступа к сегменту оперативной памяти дискредитируемого объекта, в котором расположен буфер обмена","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":94,"Name":"Угроза несанкционированного управления синхронизацией и состоянием","Description":"Угроза заключается в возможности изменения нарушителем последовательности действий, выполняемых дискредитируемыми приложениями, использующими в своей работе технологии управления процессами на основе текущего времени и состояния информационной системы (например, текущих значений глобальных переменных, наличия запущенных процессов и др.), или в возможности модификации настроек и изменения режимов работы промышленных роботов, приводящих к вмешательству в производственный процесс и хищению хранящейся в памяти роботов информации (исходного кода, параметров продукции и др.).\r\nДанная угроза основана на слабостях механизма управления синхронизацией и состоянием, позволяющих нарушителю вносить изменения в его работу в определённые промежутки времени, или отсутствии механизмов аутентификации и авторизации.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя возможности:\r\nконтролировать состояние дискредитируемого приложения (этапы выполнения алгоритма) или промышленных роботов;\r\nотслеживать моменты времени, когда дискредитируемое приложение временно прерывает свою работу с глобальными данными;\r\nвыполнить деструктивные действия в определённые моменты времени (например, внести изменения в файл с данными или изменить содержимое ячейки памяти)","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":95,"Name":"Угроза несанкционированного управления указателями","Description":"Угроза заключается в возможности выполнения нарушителем произвольного вредоносного кода от имени дискредитируемого приложения или приведения дискредитируемого приложения в состояние «отказ в обслуживании» путём изменения указателей на ячейки памяти, содержащие определённые данные, используемые дискредитируемым приложением.\r\nДанная угроза связана с уязвимостями в средствах разграничения доступа к памяти и контроля целостности содержимого ячеек памяти.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение указателей, используемых дискредитируемым приложением","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":96,"Name":"Угроза несогласованности политик безопасности элементов облачной инфраструктуры","Description":"Угроза заключается в возможности осуществления нарушителем деструктивных программных воздействий как в отношении поставщиков, так и потребителей облачных услуг.\r\nДанная угроза обусловлена недостаточностью проработки вопроса управления политиками безопасности элементов облачной инфраструктуры вследствие значительной распределённости облачной инфраструктуры.\r\nРеализация данной угрозы возможна при условии использования различных политик безопасности, несогласованных между собой (например, одно средство защиты может отказать в доступе, а другое – предоставить доступ)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, облачная система","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":97,"Name":"Угроза несогласованности правил доступа к большим данным","Description":"Угроза заключается в возможности предоставления ошибочного неправомерного доступа к защищаемой информации или, наоборот, возможности отказа в доступе к защищаемой информации легальным пользователям в силу ошибок, допущенных при делегировании им привилегий другими легальными пользователями хранилища больших данных.\r\nДанная угроза обусловлена недостаточностью мер по разграничению и согласованию доступа к информации различных пользователей в хранилище больших данных.\r\nРеализация данной угрозы возможна при условии использования различных политик безопасности, несогласованных между собой (например, одно средство защиты может отказать в доступе, а другое – предоставить доступ)","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Хранилище больших данных","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":98,"Name":"Угроза обнаружения открытых портов и идентификации привязанных к ним сетевых служб","Description":"Угроза заключается в возможности определения нарушителем состояния сетевых портов дискредитируемой системы (т.н. сканирование портов) для получения сведений о возможности установления соединения с дискредитируемой системой по данным портам, конфигурации самой системы и установленных средств защиты информации, а также других сведений, позволяющих нарушителю определить по каким портам деструктивные программные воздействия могут быть осуществлены напрямую, а по каким – только с использованием специальных техник обхода межсетевых экранов.\r\nДанная угроза связана с уязвимостями и ошибками конфигурирования средств межсетевого экранирования и фильтрации сетевого трафика, используемых в дискредитируемой системе.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя подключения к дискредитируемой вычислительной сети и специализированного программного обеспечения, реализующего функции сканирования портов и анализа сетевого трафика","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-05-21T00:00:00"},{"Id":99,"Name":"Угроза обнаружения хостов","Description":"Угроза заключается в возможности сканирования нарушителем вычислительной сети для выявления работающих сетевых узлов. \r\nДанная угроза связана со слабостями механизмов сетевого взаимодействия, предоставляющих клиентам сети открытую техническую информацию о сетевых узлах, а также с уязвимостями и ошибками конфигурирования средств межсетевого экранирования и фильтрации сетевого трафика, используемых в дискредитируемой системе.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя подключения к дискредитируемой вычислительной сети и специализированного программного обеспечения, реализующего функции анализа сетевого трафика","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":100,"Name":"Угроза обхода некорректно настроенных механизмов аутентификации","Description":"Угроза заключается в возможности получения нарушителем привилегий в системе без прохождения процедуры аутентификации за счёт выполнения действий, нарушающих условия корректной работы средств аутентификации (например, ввод данных неподдерживаемого формата).\r\nДанная угроза обусловлена в случае некорректных значений параметров конфигурации средств аутентификации и/или отсутствием контроля входных данных.\r\nРеализация данной угрозы возможна при условии наличия ошибок в заданных значениях параметров настройки механизмов аутентификации","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":101,"Name":"Угроза общедоступности облачной инфраструктуры","Description":"Угроза заключается в возможности осуществления несанкционированного доступа к защищаемой информации одного потребителя облачных услуг со стороны другого.\r\nДанная угроза обусловлена тем, что из-за особенностей облачных технологий потребителям облачных услуг приходится совместно использовать одну и ту же облачную инфраструктуру.\r\nРеализация данной угрозы возможна в случае допущения ошибок при разделении элементов облачной инфраструктуры между потребителями облачных услуг, а также при изоляции их ресурсов и обособлении данных друг от друга","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Объекты файловой системы, аппаратное обеспечение, облачный сервер","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":102,"Name":"Угроза опосредованного управления группой программ через совместно используемые данные","Description":"Угроза заключается в возможности опосредованного изменения нарушителем алгоритма работы группы программ, использующих одновременно общие данные, через перехват управления над одной из них (ячейки оперативной памяти, глобальные переменные, файлы конфигурации и др.).\r\nДанная угроза обусловлена наличием слабостей в механизме контроля внесённых изменений в общие данные каждой из программ в группе.\r\nРеализация данной угрозы возможна в случае успешного перехвата нарушителем управления над одной из программ в группе программ, использующих общие данные","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":103,"Name":"Угроза определения типов объектов защиты","Description":"Угроза заключается в возможности проведения нарушителем анализа выходных данных дискредитируемой системы с помощью метода, позволяющего определить точные значения параметров и свойств, однозначно присущих дискредитируемой системе (данный метод известен как «fingerprinting», с англ. «дактилоскопия»). Использование данного метода не наносит прямого вреда дискредитируемой системе. Однако сведения, собранные таким образом, позволяют нарушителю выявить слабые места дискредитируемой системы, которые могут быть использованы в дальнейшем при реализации других угроз.\r\nДанная угроза обусловлена ошибками в параметрах конфигурации средств межсетевого экранирования, а также с отсутствием механизмов контроля входных и выходных данных.\r\nРеализация данной угрозы возможна в случае наличия у нарушителя сведений о взаимосвязи выходных данных с конфигурацией дискредитируемой системы (документация на программные средства, стандарты передачи данных, спецификации и т.п.)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":104,"Name":"Угроза определения топологии вычислительной сети","Description":"Угроза заключается в возможности определения нарушителем состояния сетевых узлов дискредитируемой системы (т.н. сканирование сети) для получения сведений о топологии дискредитируемой вычислительной сети, которые могут быть использованы в дальнейшем при попытках реализации других угроз.\r\nДанная угроза связана со слабостями механизмов сетевого взаимодействия, предоставляющих клиентам сети открытую техническую информацию о сетевых узлах, а также с уязвимостями средств межсетевого экранирования (алгоритма работы и конфигурации правил фильтрации сетевого трафика).\r\nРеализация данной угрозы возможна в случае наличия у нарушителя возможности подключения к исследуемой вычислительной сети и наличием специализированного программного обеспечения, реализующего функцию анализа сетевого трафика","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":105,"Name":"Угроза отказа в загрузке входных данных неизвестного формата хранилищем больших данных","Description":"Угроза заключается в возможности отказа хранилищем больших данных в приёме входных данных неизвестного формата от легального пользователя.\r\nДанная угроза обусловлена отсутствием в хранилище больших данных механизма самостоятельной (автоматической) адаптации к новым форматам данных.\r\nРеализация данной угрозы возможна при условии поступления запроса на загрузку в хранилище входных данных неизвестного формата","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Хранилище больших данных, метаданные","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":106,"Name":"Угроза отказа в обслуживании системой хранения данных суперкомпьютера","Description":"Угроза заключается в возможности значительного замедления работы терминальных сессий всех пользователей суперкомпьютера, вплоть до достижения всем суперкомпьютером состояния «отказ в обслуживании» при превышении максимально достижимой нагрузки на параллельную файловую систему суперкомпьютера.\r\nДанная угроза обусловлена значительным повышением числа и объёма сохраняемых на накопитель данных для некоторых вычислительных задач.\r\nРеализация данной угрозы возможна при условии интенсивного файлового ввода-вывода в кластерной файловой подсистеме суперкомпьютера, основанной на использовании параллельной файловой системы","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Система хранения данных суперкомпьютера","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":107,"Name":"Угроза отключения контрольных датчиков","Description":"Угроза заключается в возможности обеспечения нарушителем информационной изоляции системы безопасности путём прерывания канала связи с контрольными датчиками, следящими за параметрами состояния системы, или нарушения работы самих датчиков. При этом система перестанет реагировать как на инциденты безопасности (если отключённые датчики являлись частью системы безопасности, например, датчики движения), так и на другие типы инцидентов (например, при отключении датчиков пожарной сигнализации, повышения давления в гидроагрегатах и др.).\r\nДанная угроза обусловлена слабостями мер защиты информации в автоматизированных системах управления технологическими процессами, а также наличием уязвимостей в программном обеспечении, реализующим данные меры.\r\nРеализация данной угрозы возможна при условии получения доступа (физического или программного) к линиям связи системы безопасности с контрольными датчиками или к самим датчикам","Sources":[{"violator":1,"potential":0},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":108,"Name":"Угроза ошибки обновления гипервизора","Description":"Угроза заключается в возможности дискредитации нарушителем функционирующих на базе гипервизора защитных механизмов, предотвращающих несанкционированный доступ к образам виртуальных машин, из-за ошибок его обновления.\r\nДанная угроза обусловлена зависимостью функционирования каждого виртуального устройства и каждого виртуализированного субъекта доступа, а также всей виртуальной инфраструктуры (или её части, если используется более одного гипервизора) от работоспособности гипервизора.\r\nРеализация данной угрозы возможна при условии возникновения ошибок в процессе обновления гипервизора:\r\nсбоев в процессе его обновления;\r\nобновлений, в ходе которых внедряются новые ошибки в код гипервизора;\r\nобновлений, в ходе которых в гипервизор внедряется программный код, вызывающий несовместимость гипервизора со средой его функционирования;\r\nдругих инцидентов безопасности информации","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, гипервизор","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":109,"Name":"Угроза перебора всех настроек и параметров приложения","Description":"Угроза заключается в возможности получения нарушителем доступа к дополнительному скрытому функционалу (информация о котором не была опубликована разработчиком) или приведению системы в состояние «отказ в обслуживании» при задании нарушителем некоторых параметров конфигурации программы, достигая таких значений параметров путём перебора всех возможных комбинаций.\r\nДанная угроза обусловлена уязвимостями программного обеспечения, проявляющимися при его неправильной конфигурации.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на изменение конфигурации программного обеспечения. При реализации данной угрозы, в отличии от других подобных угроз, нарушитель действует «вслепую» – простым путём перебора всевозможных комбинаций","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение, микропрограммное обеспечение, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":110,"Name":"Угроза перегрузки грид-системы вычислительными заданиями","Description":"Угроза заключается в возможности снижения пропускной способность ресурсных центров при отправке большого количества заданий одним пользователем (нарушителем) случайно или намеренно, что может сделать невозможной постановку заданий другими пользователями грид-системы в очередь на выполнение.\r\nДанная угроза обусловлена слабостями мер по контролю в грид-системе за количеством вычислительных заданий, запускаемых пользователями грид-системы.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на постановку заданий в очередь на выполнение грид-системой","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Ресурсные центры грид-системы","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":111,"Name":"Угроза передачи данных по скрытым каналам","Description":"Угроза заключается в возможности осуществления нарушителем неправомерного вывода защищаемой информации из системы, а также передаче управляющих команд путём её нестандартного (незаметного, скрытого) размещения в легитимно передаваемых по сети (или сохраняемых на отчуждаемые носители) открытых данных путём её маскирования под служебные протоколы, сокрытия в потоке других данных (стеганография), использования скрытых пикселей («пикселей отслеживания») и т.п.\r\nДанная угроза обусловлена недостаточностью мер защиты информации от утечки, а также контроля потоков данных.\r\nРеализация данной угрозы возможна при:\r\nналичии у нарушителя прав в дискредитируемой системе на установку специализированного программного обеспечения, реализующего функции внедрения в пакеты данных, формируемых для передачи в системе, собственной информации;\r\nдоступа к каналам передачи данных;\r\nпосещении пользователем сайтов в сети Интернет и открытия электронных писем, содержащих скрытые пиксели","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":112,"Name":"Угроза передачи запрещённых команд на оборудование с числовым программным управлением","Description":"Угроза заключается в возможности повреждения нарушителем исполнительных механизмов, заготовки и (или) обрабатывающего инструмента оборудования с числовым программным управлением путём передачи на него команд, приводящих к перемещению обрабатывающего инструмента за допустимые пределы (т.е. команд, запрещённых для оборудования с числовым программным управлением).\r\nДанная угроза обусловлена слабостями мер по защите оборудования с числовым программным управлением от выполнения запрещённых команд.\r\nРеализация данной угрозы возможна при наличии у нарушителя привилегий на передачу команд на оборудование с числовым программным управлением или возможности изменения команд, передаваемых легальным пользователем","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":113,"Name":"Угроза перезагрузки аппаратных и программно-аппаратных средств вычислительной техники","Description":"Угроза заключается в возможности сброса пользователем (нарушителем) состояния оперативной памяти (обнуления памяти) путём случайного или намеренного осуществления перезагрузки отдельных устройств, блоков или системы в целом.\r\nДанная угроза обусловлена свойством оперативной памяти обнулять своё состояние при выключении и перезагрузке.\r\nРеализация данной угрозы возможна как аппаратным способом (нажатием кнопки), так и программным (локально или удалённо) при выполнении следующих условий:\r\nналичие в системе открытых сессий работы пользователей;\r\nналичие у нарушителя прав в системе (или физической возможности) на осуществление форсированной перезагрузки","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":114,"Name":"Угроза переполнения целочисленных переменных","Description":"Угроза заключается в возможности приведения нарушителем дискредитируемого приложения к сбоям в работе путём подачи на его входные интерфейсы данных неподдерживаемого формата или выполнения с его помощью операции, в результате которой будут получены данные неподдерживаемого дискредитируемым приложением формата.\r\nДанная угроза обусловлена уязвимостями программного обеспечения, связанными с недостаточной проверкой такими приложениями корректности входных данных, а также тем, что операторы любого программного обеспечения способны правильно обрабатывать только определённые типы данных (например, только целые или только положительные числа).\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсведений о номенклатуре поддерживаемых дискредитируемым приложением форматов входных (или обрабатываемых) данных;\r\nвозможности взаимодействия с входным интерфейсом дискредитируемого приложения","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":115,"Name":"Угроза перехвата вводимой и выводимой на периферийные устройства информации","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информации, вводимой и выводимой на периферийные устройства, путём перехвата данных, обрабатываемых контроллерами периферийных устройств.\r\nДанная угроза обусловлена недостаточностью мер защиты информации от утечки и контроля потоков данных, а также невозможностью осуществления защиты вводимой и выводимой на периферийные устройства информации с помощью криптографических средств (т.к. представление пользователям системы информации должно осуществляться в доступном для понимания виде).\r\nРеализация данной угрозы возможна при условии наличия у нарушителя привилегий на установку и запуск специализированных вредоносных программ, реализующих функции «клавиатурных шпионов» (для получения нарушителем паролей пользователей), виртуальных драйверов принтеров (перехват документов, содержащих защищаемую информацию) и др.","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":116,"Name":"Угроза перехвата данных, передаваемых по вычислительной сети","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к сетевому трафику дискредитируемой вычислительной сети в пассивном (иногда в активном) режиме (т.е. «прослушивать сетевой трафик») для сбора и анализа сведений, которые могут быть использованы в дальнейшем для реализации других угроз, оставаясь при реализации данной угрозы невидимым (скрытным) получателем перехватываемых данных. Кроме того, нарушитель может проводить исследования других типов потоков данных, например, радиосигналов.\r\nДанная угроза обусловлена слабостями механизмов сетевого взаимодействия, предоставляющими сторонним пользователям открытые данные о дискредитируемой системе, а также ошибками конфигурации сетевого программного обеспечения.\r\nРеализация данной угрозы возможна в следующих условиях:\r\nналичие у нарушителя доступа к дискредитируемой вычислительную сети;\r\nнеспособность технологий, с помощью которых реализована передача данных, предотвратить возможность осуществления скрытного прослушивания потока данных","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":117,"Name":"Угроза перехвата привилегированного потока","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к потоку данных, созданного приложением с дополнительными привилегиями (к привилегированному потоку данных), путём синхронного (вызов привилегированной функции, возвращающей неправильное значение) или асинхронного (создание обратных вызовов, манипулирование указателями и т.п.) деструктивного программного воздействия на него.\r\nДанная угроза обусловлена уязвимостями программного обеспечения, использующего в своей работе участки кода, исполняемого с дополнительными правами, наследуемыми создаваемыми привилегированными потоками (наличие ошибочных указателей, некорректное освобождение памяти и т.п.).\r\nРеализация данной угрозы возможна в следующих условиях:\r\nв дискредитируемом приложении существуют участки кода, требующие исполнения с правами, превышающими права обычных пользователей;\r\nнарушитель обладает привилегиями, позволяющими вносить изменения во входные данные дискредитируемого приложения","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":118,"Name":"Угроза перехвата привилегированного процесса","Description":"Угроза заключается в возможности получения нарушителем права управления процессом, обладающим высокими привилегиями (например, унаследованными от пользователя или группы пользователей, выполняющих роль администраторов дискредитируемой системы), для выполнения произвольного вредоносного кода с правами дискредитированного процесса.\r\nДанная угроза обусловлена уязвимостями программного обеспечения, выполняющего функции разграничения доступа (в алгоритме или параметрах конфигурации), приводящими к некорректному распределению прав доступа внутри древа наследуемых процессов.\r\nРеализация данной угрозы возможна при выполнении одного из условий:\r\nуспешного введения нарушителем некорректных данных, приводящих к переполнению буфера или к реализации некоторых типов программных инъекций;\r\nналичия у нарушителя привилегий на запуск системных утилит, предназначенных для управления процессами","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":119,"Name":"Угроза перехвата управления гипервизором","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам, зарезервированным и управляемым гипервизором, за счёт получения нарушителем права управления гипервизором путём эксплуатации уязвимостей консоли управления гипервизором.\r\nДанная угроза обусловлена наличием у консоли управления гипервизором программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данной консоли (программа уровня виртуализации), а также недостаточностью мер по разграничению доступа к данной консоли.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с консолью управления гипервизором","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, гипервизор, консоль управления гипервизором","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":120,"Name":"Угроза перехвата управления средой виртуализации","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам, зарезервированным и управляемым всеми гипервизорами, реализующими среду виртуализации, за счёт получения нарушителем права управления этими гипервизорами путём эксплуатации уязвимостей консоли средства управления виртуальной инфраструктурой.\r\nДанная угроза обусловлена наличием у консоли средства управления виртуальной инфраструктурой, реализуемого в рамках одной из виртуальных машин, программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данной консоли (программа уровня управления виртуализации), а также недостаточностью мер по разграничению доступа к данной консоли.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с консолью средства управления виртуальной инфраструктурой","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Информационная система, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":121,"Name":"Угроза повреждения системного реестра","Description":"Угроза заключается в возможности нарушения доступности части функционала или всей информационной системы из-за повреждения используемого в её работе реестра вследствие некорректного завершения работы операционной системы (неконтролируемая перезагрузка, возникновения ошибок в работе драйверов устройств и т.п.), нарушения целостности файлов, содержащих в себе данные реестра, возникновения ошибок файловой системы носителя информации или вследствие осуществления нарушителем деструктивного программного воздействия на файловые объекты, содержащие реестр.\r\nДанная угроза обусловлена слабостями мер контроля доступа к файлам, содержащим данные реестра, мер резервирования и контроля целостности таких файлов, а также мер восстановления работоспособности реестра из-за сбоев в работе операционной системы.\r\nРеализация данной угрозы возможна при одном из условий:\r\nвозникновения ошибок в работе отдельных процессов или всей операционной системы;\r\nналичии у нарушителя прав доступа к реестру или файлам, содержащим в себе данные реестра","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Объекты файловой системы, реестр","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":122,"Name":"Угроза повышения привилегий","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на дискредитируемый процесс (или систему) или на другие процессы (или системы) от его (её) имени путём эксплуатации неправомерно полученных нарушителем дополнительных прав на управление дискредитированным объектом.\r\nДанная угроза обусловлена уязвимостями программного обеспечения, выполняющего функции разграничения доступа (в алгоритме или параметрах конфигурации).\r\nРеализация данной угрозы возможна при наличии у нарушителя программного обеспечения (типа «эксплойт»), специально разработанного для реализации данной угрозы в дискредитируемой системе","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение, сетевое программное обеспечение, информационная система","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":123,"Name":"Угроза подбора пароля BIOS","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к настройкам BIOS/UEFI путём входа в консоль BIOS/UEFI по паролю, подобранному программно или «вручную» с помощью методов тотального перебора вариантов или подбора по словарю.\r\nДанная угроза обусловлена слабостями механизма аутентификации, реализуемого в консолях BIOS/UEFI.\r\nРеализация данной угрозы возможна в одном из следующих случаев:\r\nнарушитель может осуществить физический доступ к компьютеру и имеет возможность его перезагрузить;\r\nнарушитель обладает специальным программным средством перебора паролей BIOS/UEFI и привилегиями в системе на установку и запуск таких средств","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":124,"Name":"Угроза подделки записей журнала регистрации событий","Description":"Угроза заключается в возможности внесения нарушителем изменений в журналы регистрации событий безопасности дискредитируемой системы (удаление компрометирующих нарушителя записей или подделка записей о не произошедших событиях) для введения в заблуждение её администраторов или сокрытия следов реализации других угроз.\r\nДанная угроза обусловлена недостаточностью мер по разграничению доступа к журналу регистрации событий безопасности.\r\nРеализация данной угрозы возможна в одном из следующих случаев:\r\nтехнология ведения журналов регистрации событий безопасности предполагает возможность их редактирования и нарушитель обладает необходимыми для этого привилегиями;\r\nтехнология ведения журналов регистрации событий безопасности не предполагает возможность их редактирования, но нарушитель обладает привилегиями, необходимыми для осуществления записи в файлы журналов, а также специальными программными средствами, способными обрабатывать файлы журналов используемого в дискредитируемой системе формата","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":125,"Name":"Угроза подключения к беспроводной сети в обход процедуры аутентификации","Description":"Угроза заключается в возможности осуществления нарушителем перехвата трафика беспроводной сети или других неправомерных действий путём легализации нарушителем собственного подключения к беспроводной сети в полуавтоматическом режиме (например, WPS) без ввода ключа шифрования.\r\nДанная угроза обусловлена слабостями процедуры аутентификации беспроводных устройств в ходе полуавтоматического подключения.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к беспроводной точке доступа, поддерживающей полуавтоматический режим подключения","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":126,"Name":"Угроза подмены беспроводного клиента или точки доступа","Description":"Угроза заключается в возможности получения нарушителем аутентификационной или другой защищаемой информации, передаваемой в ходе автоматического подключения точек беспроводного доступа или клиентского программного обеспечения к доверенным субъектам сетевого взаимодействия, подменённым нарушителем.\r\nДанная угроза обусловлена слабостями механизма аутентификации субъектов сетевого взаимодействия при беспроводном доступе.\r\nРеализация данной угрозы возможна в случае размещения нарушителем клиента или точки беспроводного доступа со специально сформированными параметрами работы (такими как MAC-адрес, название, используемый стандарт передачи данных и т.п.) в зоне доступности для дискредитируемых устройств беспроводного доступа","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, аппаратное обеспечение, точка беспроводного доступа","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":127,"Name":"Угроза подмены действия пользователя путём обмана","Description":"Угроза заключается в возможности нарушителя выполнения неправомерных действий в системе от имени другого пользователя с помощью методов социальной инженерии (обмана пользователя, навязывание ложных убеждений) или технических методов (использование прозрачных кнопок, подмена надписей на элементах управления и др.)\r\nДанная угроза обусловлена слабостями интерфейса взаимодействия с пользователем или ошибками пользователя.\r\nРеализация данной угрозы возможна при условии наличия у дискредитируемого пользователя прав на проведение нужных от него нарушителю операций","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":128,"Name":"Угроза подмены доверенного пользователя","Description":"Угроза заключается в возможности нарушителя выдавать себя за легитимного пользователя и выполнять приём/передачу данных от его имени. Данную угрозу можно охарактеризовать как «имитация действий клиента».\r\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности источника/получателя информации.\r\nРеализация данной угрозы возможна при наличии у нарушителя подключения к вычислительной сети, а также сведений о конфигурации сетевых устройств, типе используемого программного обеспечения и т.п.","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":129,"Name":"Угроза подмены резервной копии программного обеспечения BIOS","Description":"Угроза заключается в возможности опосредованного внедрения нарушителем в BIOS/UEFI дискредитируемого компьютера вредоносного кода, путём ожидания или создания необходимости выполнения процедуры восстановления предыдущей версии программного обеспечения BIOS/UEFI, предварительно подменённой нарушителем.\r\nДанная угроза обусловлена недостаточностью мер разграничения доступа и контроля целостности резервных копий программного обеспечения BIOS/UEFI.\r\nРеализация данной угрозы возможна в следующих условиях:\r\nнарушитель успешно подменил резервную копию программного обеспечения BIOS/UEFI;\r\nвозникла необходимость восстановления предыдущей версии программного обеспечения BIOS/UEFI (данное условие может произойти как случайно, так и быть спровоцировано нарушителем)","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":130,"Name":"Угроза подмены содержимого сетевых ресурсов","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемым данным пользователей сети или проведения различных мошеннических действий путём скрытной подмены содержимого хранящихся (сайты, веб-страницы) или передаваемых (электронные письма, сетевые пакеты) по сети данных.\r\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности содержимого электронного сообщения.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на доступ к сетевым ресурсам и отсутствии у пользователя сети мер по обеспечению их целостности","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":131,"Name":"Угроза подмены субъекта сетевого доступа","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к защищаемым данным пользователей сети или проведения различных мошеннических действий путём скрытной подмены в отправляемых дискредитируемым пользователем сетевых запросах сведений об отправителе сообщения. Данную угрозу можно охарактеризовать как «имитация действий сервера».\r\nДанная угроза обусловлена слабостями технологий сетевого взаимодействия, зачастую не позволяющими выполнить проверку подлинности источника информации.\r\nРеализация данной угрозы возможна при условии успешной выдачи себя нарушителем за законного отправителя (например, с помощью ложных фишинговых веб-сайтов). Ключевое отличие от «угрозы подмены содержимого сетевых ресурсов» заключается в том, что в данном случае нарушитель не изменяет оригинального содержимого электронного ресурса (веб-сайта, электронного письма), а только служебные сведения","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":132,"Name":"Угроза получения предварительной информации об объекте защиты","Description":"Угроза заключается в возможности раскрытия нарушителем защищаемых сведений о состоянии защищённости дискредитируемой системы, её конфигурации и потенциальных уязвимостях и др., путём проведения мероприятий по сбору и анализу доступной информации о системе.\r\nДанная угроза обусловлена наличием уязвимостей в сетевом программном обеспечении, позволяющим получить сведения о конфигурации отдельных программ или системы в целом (отсутствие контроля входных данных, наличие открытых сетевых портов, неправильная настройка политик безопасности и т.п.).\r\nРеализация данной угрозы возможна при условии получения информации о дискредитируемой системе с помощью хотя бы одного из следующих способов изучения дискредитируемой системы:\r\nанализ реакций системы на сетевые (в т.ч. синтаксически неверные или нестандартные) запросы к открытым в системе сетевым сервисам, которые могут стать причиной вызова необработанных исключений с подробными сообщениями об ошибках, содержащих защищаемую информацию (о трассировке стека, о конфигурации системы, о маршруте прохождения сетевых пакетов)\r\nанализ реакций системы на строковые URI-запросы (в т.ч. неверные SQL-запросы, альтернативные пути доступа к файлам).\r\nДанная угроза отличается от угрозы перехвата данных и других угроз сбора данных тем, что нарушитель активно опрашивает дискредитируемую систему, а не просто за ней наблюдает","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение, сетевой трафик, прикладное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":133,"Name":"Угроза получения сведений о владельце беспроводного устройства","Description":"Угроза заключается в возможности раскрытия нарушителем сведений о географических перемещениях дискредитируемого пользователя в определённые промежутки времени, в том числе выявить место его работы, проживания и т.п. Получение таких сведений может использоваться нарушителем в дальнейшем для реализации угроз в информационных системах, доступ к которым имеет дискредитируемый пользователь.\r\nДанная угроза обусловлена слабостью защиты идентификационной информации беспроводных точек доступа при их подключении к сети Интернет.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя доступа к идентификационными данным стационарных точек беспроводного доступа, с которыми в автоматическом режиме осуществляет взаимодействие беспроводное устройство дискредитируемого пользователя","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, метаданные","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":134,"Name":"Угроза потери доверия к поставщику облачных услуг","Description":"Угроза заключается в возможности снижения уровня защищённости и допущения дополнительных ошибок в обеспечении безопасности защищаемой в облачной системе информации из-за невосполнимого оттока у поставщика облачных услуг необходимых ресурсов в связи с потерей потребителями облачных услуг доверия к их поставщику.\r\nДанная угроза обусловлена тем, что из-за обнародования фактов об инцидентах информационной безопасности, связанных с поставщиком облачных услуг, происходит потеря доверия к такому поставщику со стороны потребителей облачных услуг, и, как следствие, возникает необходимость лавинообразного выделения поставщиком облачных услуг ресурсов (человеческих, технических, финансовых) для решения возникающих в данной ситуации задач (множественные консультации пользователей, экстренный пересмотр политик безопасности, модернизация системы защиты и др.), что не только может вызвать нехватку ресурсов для обеспечения текущего уровня защищённости информации, но и спровоцировать допуск «в спешке» новых ошибок.\r\nРеализация данной угрозы возможна в случае обнародования единичных или множественных фактов об инцидентах информационной безопасности, связанных с поставщиком облачных услуг, повлёкших значительные убытки для его клиентов","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Объекты файловой системы, информационная система, иммигрированная в облако","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":135,"Name":"Угроза потери и утечки данных, обрабатываемых в облаке","Description":"Угроза заключается в возможности нарушения конфиденциальности, целостности и доступности защищаемой информации потребителей облачных услуг, обрабатываемой в облачной системе.\r\nДанная угроза обусловлена слабостями мер защиты информации, обрабатываемой в облачной системе.\r\nРеализация данной угрозы возможна в случае допущения поставщиком (некорректный выбор или настройка средств защиты) или потребителем (потеря пароля, электронного ключа, вход с небезопасной консоли) облачных услуг ошибок при обеспечении безопасности защищаемой информации","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, метаданные, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":136,"Name":"Угроза потери информации вследствие несогласованности работы узлов хранилища больших данных","Description":"Угроза заключается в возможности допуска ошибок при копировании защищаемой информации при распределённом хранении данных на различных узлах хранилища больших данных вследствие несогласованности их работы, влекущих за собой невозможность осуществления легальным пользователем доступа к блокам или ко всей защищаемой информации.\r\nДанная угроза обусловлена слабостями механизмов репликации данных, реализованных в узлах хранилища больших данных.\r\nРеализация данной угрозы возможна в условиях отключения или выведения из строя одного или нескольких узлов за счёт специальных программных воздействий на узлы хранилища больших данных, а также возникновения технических или программных сбоев в работе их компонентов","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Информационная система, узлы хранилища больших данных","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":137,"Name":"Угроза потери управления облачными ресурсами","Description":"Угроза заключается в возможности нарушения договорных обязательств со стороны поставщика облачных услуг в отношении их потребителя из-за значительной сложности построения эффективной системы управления облачными ресурсами облачной системы, особенно использующей облачные ресурсы других поставщиков облачных услуг.\r\nДанная угроза обусловлена сложностью определения логического и физического местоположения облачных ресурсов, недостаточностью мер физического контроля доступа к хранилищам данных, резервного копирования и др., а также необходимостью учёта особенностей законодательства в области защиты информации стран, резидентами которых являются поставщики облачных услуг, выполняющих роль субподрядчиков по оказанию заказанных облачных услуг.\r\nРеализация данной угрозы возможна при условии, что выполнение требований к функционалу облачной системы затрудняется (или становится невозможным) из-за правовых норм других стран, участвующих в трансграничной передаче облачного трафика","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Сетевой трафик, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":138,"Name":"Угроза потери управления собственной инфраструктурой при переносе её в облако","Description":"Угроза заключается в возможности допуска ошибок в управлении инфраструктурой системы потребителя облачных услуг, иммигрированной в облако, со стороны поставщика облачных услуг из-за отсутствия у него сведений об особенностях управления конкретной системы, а также из-за отсутствия у потребителя облачных услуг, обладающего такими сведениями, возможности проводить весь комплекс работ по управлению инфраструктурой собственной системы в связи с её иммиграцией в облако.\r\nДанная угроза обусловлена невозможностью достоверной оценки потребителем облачных услуг реального уровня защищённости, обеспечиваемого поставщиком облачных услуг в отношении защищаемой информации потребителя облачных услуг, в связи с закрытостью для потребителей сведений о применяемых поставщиком облачных услуг технологиях, программных и технических решениях, а также конкретных параметрах настроек средств защиты информации.\r\nРеализация данной угрозы возможна в случаях передачи поставщику облачных услуг части функций управления системой потребителя облачных услуг (при миграции части или всей системы в облако)","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Информационная система, иммигрированная в облако, системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":139,"Name":"Угроза преодоления физической защиты","Description":"Угроза заключается в возможности осуществления нарушителем практически любых деструктивных действий в отношении дискредитируемой информационной системы при получении им физического доступа к аппаратным средствам вычислительной техники системы путём преодоления системы контроля физического доступа, организованной в здании предприятия.\r\nДанная угроза обусловлена уязвимостями в системе контроля физического доступа (отсутствием замков в помещении, ошибками персонала и т.п.).\r\nРеализация данной угрозы возможна при условии успешного применения нарушителем любого из методов проникновения на объект (обман персонала, взлом замков и др.)","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сервер, рабочая станция, носитель информации, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":140,"Name":"Угроза приведения системы в состояние «отказ в обслуживании»","Description":"Угроза заключается в возможности отказа дискредитированной системой в доступе легальным пользователям при лавинообразном увеличении числа сетевых соединений с данной системой или при использовании недостатков реализации сетевых протоколов.\r\nДанная угроза обусловлена тем, что для обработки каждого сетевого запроса системой потребляется часть её ресурсов, а также слабостями сетевых технологий, связанными с ограниченностью скорости обработки потоков сетевых запросов, и недостаточностью мер контроля за управлением соединениями и ошибками реализации сетевых протоколов.\r\nРеализация данной угрозы возможна при условии превышения объёма запросов над объёмами доступных для их обработки ресурсов дискредитируемой системы или наличия ошибок реализации сетевых протоколов (например, формирование IP-адреса версии 6 на основе MAC-адреса, определение доступности IP-адреса, использование функции контроля целостности PPP-интерфейса и др.)","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сетевой узел, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик, телекоммуникационное устройство","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-12T00:00:00"},{"Id":141,"Name":"Угроза привязки к поставщику облачных услуг","Description":"Угроза заключается в возможности возникновения трудно решаемых (или даже неразрешимых) проблем технического, организационного, юридического или другого характера, препятствующих осуществлению потребителем облачных услуг смены их поставщика.\r\nДанная угроза обусловлена отсутствием совместимости между форматами данных и программными интерфейсами, используемыми в облачных инфраструктурах различных поставщиков облачных услуг.\r\nРеализация данной угрозы возможна при условии использования поставщиком облачных услуг нестандартного программного обеспечения или формата образов виртуальных машин и отсутствием средств преобразования образа виртуальной машины из используемого им формата в другой (используемый другим поставщиком)","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Информационная система, иммигрированная в облако, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик, объекты файловой системы","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":142,"Name":"Угроза приостановки оказания облачных услуг вследствие технических сбоев","Description":"Угроза заключается в возможности снижения качества облачных услуг (или даже отказа в их оказании конечным потребителям) из-за возникновения технических сбоев хотя бы у одного из поставщиков облачных услуг (входящих в цепь посредников при оказании облачных услуг их конечному потребителю), а также из-за возникновения существенных задержек или потерь в каналах передачи данных, арендуемых потребителем или поставщиками облачных услуг.\r\nДанная угроза обусловлена слабостями процедуры контроля за выполнением технического обслуживания и соблюдением режимов функционирования технических средств облачной информационной системы.\r\nРеализация данной угрозы возможна при условии отсутствия механизмов резервирования средств обработки, хранения и передачи информации, входящих в состав облачной информационной системы","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Системное программное обеспечение, аппаратное обеспечение, канал связи","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":143,"Name":"Угроза программного выведения из строя средств хранения, обработки и (или) ввода/вывода/передачи информации","Description":"Угроза заключается в возможности прерывания нарушителем технологии обработки информации в дискредитируемой системе путём осуществления деструктивного программного (локально или удалённо) воздействия на средства хранения (внешних, съёмных и внутренних накопителей), обработки (процессора, контроллера устройств и т.п.) и (или) ввода/вывода/передачи информации (клавиатуры и др.), в результате которого объект защиты перейдёт в состояние «отказ в обслуживании». При этом вывод его из этого состояния может быть невозможен путём перезагрузки системы, а потребует проведения ремонтно-восстановительных работ.\r\nДанная угроза обусловлена наличием уязвимостей микропрограммного обеспечения средств хранения, обработки и (или) ввода/вывода/передачи информации, а также невозможности длительного нахождения средств хранения, обработки и (или) ввода/вывода/передачи информации в режиме предельно допустимых значений (частота системной шины, центрального процессора, количества обращений на чтение и/или запись и другие параметры).\r\nРеализация данной угрозы возможна при наличии у нарушителя прав на отправку команды или специально сформированных входных данных на средства хранения, обработки и (или) ввода/вывода/передачи информации","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Носитель информации, микропрограммное обеспечение, аппаратное обеспечение, телекоммуникационное устройство","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-12T00:00:00"},{"Id":144,"Name":"Угроза программного сброса пароля BIOS","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к настройкам BIOS/UEFI после перезагрузки компьютера путём ввода «пустого» пароля.\r\nДанная угроза обусловлена слабостями мер разграничения доступа в операционной системе к функции сброса пароля BIOS/UEFI.\r\nРеализация данной угрозы возможна при условиях:\r\nналичия в программном обеспечении BIOS/UEFI активного интерфейса функции программного сброса пароля непосредственно из-под операционной системы;\r\nналичия у нарушителя специальных программных средств, реализующих сброс пароля, а также прав в операционной системе для установки и запуска данных средств","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":145,"Name":"Угроза пропуска проверки целостности программного обеспечения","Description":"Угроза заключается в возможности внедрения нарушителем в дискредитируемую систему вредоносного программного обеспечения путём обманного перенаправления запросов пользователя или его программ на собственный сетевой ресурс, содержащий вредоносное программное обеспечение, для его «ручной» или «автоматической» загрузки с последующей установкой в дискредитируемую систему от имени пользователя или его программ.\r\nДанная угроза обусловлена слабостями механизмов проверки целостности файлов программного обеспечения и/или проверки подлинности источника их получения.\r\nРеализация данной угрозы возможна при условии успешного использования обманных техник одного из следующих методов:\r\n«ручного метода» – нарушитель, используя обманные механизмы, убеждает пользователя перейти по ссылке на сетевой ресурс нарушителя, что приводит к запуску вредоносного кода на компьютере пользователя, или убеждает пользователя самостоятельно загрузить и установить вредоносную программу (например, под видом игры или антивирусного средства);\r\n«автоматического метода» – нарушитель осуществляет деструктивное воздействие переадресацию функции автоматического обновления дискредитируемой программы на собственный вредоносный сервер","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":146,"Name":"Угроза прямого обращения к памяти вычислительного поля суперкомпьютера","Description":"Угроза заключается в возможности осуществления процессом нарушителя, функционирующем в вычислительном поле суперкомпьютера, считывания защищаемых данных из оперативной памяти, выделенной для параллельного (дискредитируемого) процесса, с использованием операций удалённого прямого доступа к памяти.\r\nДанная угроза обусловлена слабостями протокола прямого доступа к оперативной памяти, с помощью которого выполняется обращение к сегменту памяти, выделенному для удалённого параллельного процесса, функционирующего в вычислительном поле суперкомпьютера.\r\nРеализация данной угрозы возможна при условии успешного осуществления нарушителем доступа к входным/выходным данным параллельных процессов в вычислительном поле суперкомпьютера","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Вычислительные узлы суперкомпьютера, каналы передачи данных суперкомпьютера, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":147,"Name":"Угроза распространения несанкционированно повышенных прав на всю грид-систему","Description":"Угроза заключается в возможности автоматического распространения на всю грид-систему несанкционированно полученных нарушителем на одном узле привилегий.\r\nДанная угроза обусловлена наличием уязвимостей в клиентском программном обеспечении грид-системы и слабостями в механизме назначения прав пользователям, реализованном в связующем программном обеспечении.\r\nРеализация данной угрозы возможна при условии успешного повышения нарушителем своих прав на одном узле грид-системы","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Ресурсные центры грид-системы, узлы грид-системы, грид-система, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":148,"Name":"Угроза сбоя автоматического управления системой разграничения доступа хранилища больших данных","Description":"Угроза заключается в возможности возникновения ситуаций, связанных c ошибками автоматического назначения пользователям прав доступа (наделение дополнительными полномочиями, ошибочное наследование, случайное восстановление «неактивных» учётных записей т.п.).\r\nДанная угроза обусловлена слабостями мер контроля за большим количеством (от тысячи, а в некоторых случаях и до нескольких миллионов) учётных записей пользователей со стороны администраторов безопасности.\r\nРеализация данной угрозы возможна при условии возникновения сбоев или ошибок в работе системы разграничения доступа хранилища больших данных","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Информационная система, система разграничения доступа хранилища больших данных","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":149,"Name":"Угроза сбоя обработки специальным образом изменённых файлов","Description":"Угроза заключается в возможности осуществления нарушителем различных неправомерных действий от имени дискредитированных приложений путём вызова сбоя в их работе за счёт внесения изменений в обрабатываемые дискредитируемыми программами файлы или их метаданные.\r\nДанная угроза обусловлена слабостями механизма проверки целостности обрабатываемых файлов и корректности, содержащихся в них данных.\r\nРеализация данной угрозы возможна в условиях:\r\nналичия у нарушителя сведений о форматах и значениях файлов, вызывающих сбой функционирования дискредитированных приложений при их обработке;\r\nуспешно созданном в дискредитируемой системе механизме перехвата управления над обработкой нарушителем программного сбоя","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Метаданные, объекты файловой системы, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":150,"Name":"Угроза сбоя процесса обновления BIOS","Description":"Угроза заключается в возможности выведения из строя компьютера из-за внесения критических ошибок в программное обеспечение BIOS/UEFI в результате нарушения процесса его обновления.\r\nДанная угроза обусловлена слабостями технологий контроля за обновлением программного обеспечения BIOS/UEFI.\r\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера как при установке корректной/совместимой версии обновления (из-за сбоев, помех и т.п.), так и при установке повреждённой/несовместимой версии обновления (из-за отсутствия механизма проверки целостности и совместимости)","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Микропрограммное и аппаратное обеспечение BIOS/UEFI, каналы связи","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":151,"Name":"Угроза сканирования веб-сервисов, разработанных на основе языка описания WSDL","Description":"Угроза заключается в возможности получения нарушителем сведений о текущей конфигурации веб-служб и наличии в ней уязвимостей путём исследования WSDL-интерфейса веб-сервера.\r\nДанная угроза обусловлена недостаточностью мер по обеспечению конфиденциальности информации, реализованных в WSDL-сервисах, предоставляющих подробные сведения о портах, службах и соединениях, доступных пользователям.\r\nРеализация данной угрозы возможна при наличии у нарушителя сетевого доступа к исследуемому сетевому ресурсу и специальных программных средств сканирования сети","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевое программное обеспечение, сетевой узел","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":152,"Name":"Угроза удаления аутентификационной информации","Description":"Угроза заключается в возможности отказа легитимным пользователям в доступе к информационным ресурсам, а также в возможности получения нарушителем привилегий дискредитированного пользователя за счёт сброса (обнуления, удаления) его аутентификационной информации.\r\nДанная угроза обусловлена слабостями политики разграничения доступа к аутентификационной информации и средствам работы с учётными записями пользователей.\r\nРеализация данной угрозы возможна при выполнении одного из следующих условий:\r\nштатные средства работы с учётными записями пользователей обладают функционалом сброса аутентификационной информации, и нарушитель получил привилегии в дискредитируемой системе на использование данных средств;\r\nнарушитель обладает специальным программным обеспечением, реализующим функцию сброса аутентификационной информации, и получил привилегии в дискредитируемой системе на использование данных средств","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, микропрограммное обеспечение, учётные данные пользователя","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":153,"Name":"Угроза усиления воздействия на вычислительные ресурсы пользователей при помощи сторонних серверов","Description":"Угроза заключается в возможности осуществления нарушителем опосредованного деструктивного программного воздействия на дискредитируемую систему большим объёмом сетевого трафика, генерируемого сторонними серверами в ответ на сетевые запросы нарушителя, сформированные от имени дискредитируемой системы. Генерируемый сторонними серверами сетевой трафик значительно превышает объём сетевых запросов, формируемых нарушителем.\r\nДанная угроза обусловлена слабостями мер межсетевого экранирования дискредитируемой информационной системы, мер контроля подлинности сетевых запросов на сторонних серверах, а также слабостями модели взаимодействия открытых систем.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсведений о сторонних серверах с недостаточными мерами контроля подлинности сетевых запросов;\r\nсведений о сетевом адресе дискредитируемой системы;\r\nспециального программного обеспечения, реализующего функции генерации сетевых пакетов","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сетевой узел, системное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":154,"Name":"Угроза установки уязвимых версий обновления программного обеспечения BIOS","Description":"Угроза заключается в возможности внесения уязвимостей в программное обеспечение BIOS/UEFI в ходе его обновления, которые могут быть использованы в дальнейшем для приведения компьютера в состояние «отказ в обслуживании», несанкционированного изменения конфигурации BIOS/UEFI или выполнения вредоносного кода при каждом запуске компьютера.\r\nДанная угроза обусловлена слабостями мер контроля отсутствия уязвимостей в только что вышедших версиях обновления программного обеспечения BIOS/UEFI.\r\nРеализация данной угрозы возможна в ходе проведения ремонта и обслуживания компьютера","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Микропрограммное обеспечение BIOS/UEFI","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":155,"Name":"Угроза утраты вычислительных ресурсов","Description":"Угроза заключается в возможности отказа легитимному пользователю в выделении ресурсов для обработки его запросов из-за исчерпания нарушителем свободных ресурсов в системе, осуществлённого путём их несанкционированного исключения из общего пула ресурсов на основе техник «утечки ресурсов» или «выделения ресурсов».\r\nДанная угроза обусловлена слабостями механизма контроля за распределением вычислительных ресурсов между пользователями, а также мер межсетевого экранирования дискредитируемой информационной системы и контроля подлинности сетевых запросов на сторонних серверах.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсведений о формате и параметрах деструктивных воздействий на систему, приводящих к исключению («утечки» или «выделению») свободных ресурсов из общего пула ресурсов дискредитируемой системы;\r\nпривилегий, достаточных для осуществления деструктивных воздействий («утечки» или «выделения») в дискредитируемой системе;\r\nотсутствие у администраторов возможности: для техники «утечки ресурсов» – перезагрузки системы во время отправки нарушителем большого числа запросов на выделение ресурсов, а для техники «выделения ресурсов» – форсированного освобождения ресурсов, выделенных по запросам вредоносных процессов","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Информационная система, сетевой узел, носитель информации, системное программное обеспечение, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":156,"Name":"Угроза утраты носителей информации","Description":"Угроза заключается в возможности раскрытия информации, хранящейся на утерянном носителе (в случае отсутствия шифрования данных), или её потери (в случае отсутствия резервной копий данных).\r\nДанная угроза обусловлена слабостями мер регистрации и учёта носителей информации, а также мер резервирования защищаемых данных.\r\nРеализация данной угрозы возможна вследствие халатности сотрудников","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Носитель информации","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":157,"Name":"Угроза физического выведения из строя средств хранения, обработки и (или) ввода/вывода/передачи информации","Description":"Угроза заключается в возможности умышленного выведения из строя внешним нарушителем средств хранения, обработки и (или) ввода/вывода/передачи информации, что может привести к нарушению доступности, а в некоторых случаях и целостности защищаемой информации.\r\nДанная угроза обусловлена слабостями мер контроля физического доступа к средствам хранения, обработки и (или) ввода/вывода/передачи информации.\r\nРеализация данной угрозы возможна при условии получения нарушителем физического доступа к носителям информации (внешним, съёмным и внутренним накопителям), средствам обработки информации (процессору, контроллерам устройств и т.п.) и средствам ввода/вывода информации (клавиатура и т.п.)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сервер, рабочая станция, носитель информации, аппаратное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":158,"Name":"Угроза форматирования носителей информации","Description":"Угроза заключается в возможности утраты хранящейся на форматируемом носителе информации, зачастую без возможности её восстановления, из-за преднамеренного или случайного выполнения процедуры форматирования носителя информации.\r\nДанная угроза обусловлена слабостью мер ограничения доступа к системной функции форматирования носителей информации.\r\nНа реализацию данной угрозы влияют такие факторы как:\r\nвремя, прошедшее после форматирования;\r\nтип носителя информации;\r\nтип файловой системы носителя;\r\nинтенсивность взаимодействия с носителем после форматирования и др.","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Носитель информации","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":159,"Name":"Угроза «форсированного веб-браузинга»","Description":"Угроза заключается в возможности получения нарушителем доступа к защищаемой информации, выполнения привилегированных операций или осуществления иных деструктивных воздействий на некорректно защищённые компоненты веб-приложений.\r\nДанная угроза обусловлена слабостями (или отсутствием) механизма проверки корректности вводимых данных на веб-серверах.\r\nРеализация данной угрозы возможна при условии успешной реализации «ручного ввода» в адресную строку веб-браузера определённых адресов веб-страниц и осуществления принудительного перехода по древу веб-сайта к страницам, ссылки на которые явно не указаны на веб-сайте","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":160,"Name":"Угроза хищения средств хранения, обработки и (или) ввода/вывода/передачи информации","Description":"Угроза заключается в возможности осуществления внешним нарушителем кражи компьютера (и подключённых к нему устройств), USB-накопителей, оптических дисков или других средств хранения, обработки, ввода/вывода/передачи информации.\r\nДанная угроза обусловлена слабостями мер контроля физического доступа к средствам хранения, обработки и (или) ввода/вывода/передачи информации.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя физического доступа к носителям информации (внешним, съёмным и внутренним накопителям), средствам обработки информации (процессору, контроллерам устройств и т.п.) и средствам ввода/вывода информации (клавиатура и т.п.)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сервер, рабочая станция, носитель информации, аппаратное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":161,"Name":"Угроза чрезмерного использования вычислительных ресурсов суперкомпьютера в ходе интенсивного обмена межпроцессорными сообщениями","Description":"Угроза заключается в возможности возникновения ситуации типа «отказ в обслуживании» со стороны вычислительного поля суперкомпьютера.\r\nДанная угроза обусловлена слабостями мер контроля за распределением вычислительных ресурсов суперкомпьютера при обработке задачи несколькими процессорами.\r\nРеализация данной угрозы возможна при условии выполнения суперкомпьютером специфичных вычислительных задач, в ходе которых генерируются межпроцессорные сообщения с большой интенсивностью","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Вычислительные узлы суперкомпьютера","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":162,"Name":"Угроза эксплуатации цифровой подписи программного кода","Description":"Угроза заключается в возможности повышения нарушителем привилегий в системах, использующих цифровую подпись кода в качестве связующей информации между программой и её привилегиями, путём дискредитации механизма подписывания программного кода.\r\nДанная угроза обусловлена слабостями в механизме подписывания программного кода.\r\nРеализация данной угрозы возможна при следующих условиях:\r\nдискредитируемый программный код написан с помощью фреймворка (framework), поддерживающего подписывание программного кода;\r\nдискредитируемый программный код подписан вендором (поставщиком программного обеспечения);\r\nнарушитель имеет возможность внедрить программный код в дискредитируемый компьютер","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, прикладное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-20T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":163,"Name":"Угроза перехвата исключения/сигнала из привилегированного блока функций","Description":"Угроза заключается в возможности нарушителя получить права на доступ к защищаемой информации путём перехвата исключений/сигналов, сгенерированных участком программного кода, исполняемого с повышенными привилегиями (привилегированным блоком функций) и содержащего команды по управлению защищаемой информацией.\r\nДанная угроза обусловлена тем, что вызов программных функций в привилегированном режиме подразумевает отключение для них механизмов разграничения доступа.\r\nРеализация данной угрозы возможна при следующих условиях:\r\nдискредитируемая программа, написана на языке программирования, поддерживающего механизм привилегированных блоков (например, Java);\r\nв дискредитируемой программе вызов привилегированных блоков осуществлён небезопасным способом (использовано публичное объявление внутренних функций, использована генерация исключений из привилегированного блока);\r\nнарушитель обладает правами, достаточными для перехвата программных исключений в системе","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-31T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":164,"Name":"Угроза распространения состояния «отказ в обслуживании» в облачной инфраструктуре","Description":"Угроза заключается в возможности распространения негативных последствий от реализации угроз на физическом или виртуальном уровне облачной инфраструктуры на уровни управления и оркестровки, а также на все информационные системы, развёрнутые на базе дискредитированной облачной инфраструктуры.\r\nДанная угроза обусловлена невозможностью функционирования информационных систем в облаке при некорректной работе самой облачной инфраструктуры, а также зависимостью работоспособности верхних уровней облачной инфраструктуры от работоспособности нижних.\r\nРеализация данной угрозы возможна в случае приведения облачной инфраструктуры на физическом или виртуальном уровне облачной инфраструктуры в состояние «отказ в обслуживании»","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Облачная инфраструктура, созданная с использованием технологий виртуализации","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-03-31T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":165,"Name":"Угроза включения в проект не достоверно испытанных компонентов","Description":"Угроза заключается в возможности нарушения безопасности защищаемой информации вследствие выбора для применения в системе компонентов не в соответствии с их заданными проектировщиком функциональными характеристиками, надёжностью, наличием сертификатов и др.\r\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе проектирования систем, связанных с безопасностью.\r\nРеализация данной угрозы возможна при условии выбора для применения в системе компонентов по цене, разрекламированности и др.","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение, техническое средство, информационная система, ключевая система информационной инфраструктуры","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":166,"Name":"Угроза внедрения системной избыточности","Description":"Угроза заключается в возможности снижения скорости обработки данных (т.е. доступности) компонентами программного обеспечения (или системы в целом) из-за внедрения в него (в неё) избыточных компонентов (изначально ненужных или необходимость в которых отпала при внесении изменений в проект).\r\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе проектирования систем, связанных с безопасностью.\r\nРеализация данной угрозы возможна при условии внесения изменений в перечень задач, решаемых проектируемым программным обеспечением (проектируемой системой)","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение, информационная система, ключевая система информационной инфраструктуры","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":167,"Name":"Угроза заражения компьютера при посещении неблагонадёжных сайтов","Description":"Угроза заключается в возможности нарушения безопасности защищаемой информации вредоносными программами, скрытно устанавливаемыми при посещении пользователями системы с рабочих мест (намеренно или при случайном перенаправлении) сайтов с неблагонадёжным содержимым и запускаемыми с привилегиями дискредитированных пользователей.\r\nДанная угроза обусловлена слабостями механизмов фильтрации сетевого трафика и антивирусного контроля на уровне организации.\r\nРеализация данной угрозы возможна при условии посещения пользователями системы с рабочих мест сайтов с неблагонадёжным содержимым","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":168,"Name":"Угроза «кражи» учётной записи доступа к сетевым сервисам","Description":"Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией пользователя путём получения информации идентификации/аутентификации, соответствующей учётной записи доступа пользователя к сетевым сервисам (социальной сети, облачным сервисам и др.), с которой связан неактивный/несуществующий адрес электронной почты.\r\nДанная угроза обусловлена недостаточностью мер контроля за активностью/существованием ящиков электронной почты.\r\nРеализация данной угрозы возможна при условиях:\r\nналичия статуса «свободен для занимания» у адреса электронной почты, с которым связана учётная запись доступа пользователя к сетевым сервисам (например, если пользователь указал при регистрации несуществующий адрес или долго не обращался к почтовому ящику, вследствие чего, его отключили);\r\nналичия у нарушителя сведений об адресе электронной почты, с которым связана учётная запись дискредитируемого пользователя для доступа к сетевым сервисам","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":169,"Name":"Угроза наличия механизмов разработчика","Description":"Угроза заключается в возможности перехвата управления программой за счёт использования отладочных механизмов (специальных программных функций или аппаратных элементов, помогающих проводить тестирование и отладку средств во время их разработки).\r\nДанная угроза обусловлена недостаточностью мер по контролю за ошибками в ходе разработки средств защиты информации.\r\nРеализация данной угрозы возможна при условии, что в программе не удалены отладочные механизмы","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение, техническое средство","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":170,"Name":"Угроза неправомерного шифрования информации","Description":"Угроза заключается в возможности фактической потери доступности защищаемых данных из-за их несанкционированного криптографического преобразования нарушителем с помощью известного только ему секретного ключа.\r\nДанная угроза обусловлена наличием слабостей в антивирусной защите, а также в механизмах разграничения доступа.\r\nРеализация данной угрозы возможна при условии успешной установки нарушителем на дискредитируемый компьютер средства криптографического преобразования информации, а также успешного обнаружения (идентификации) нарушителем защищаемых файлов","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Объект файловой системы","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":171,"Name":"Угроза скрытного включения вычислительного устройства в состав бот-сети","Description":"Угроза заключается в возможности опосредованного осуществления нарушителем деструктивного воздействия на информационные системы с множества вычислительных устройств (компьютеров, мобильных технических средств и др.), подключённых к сети Интернет, за счёт захвата управления такими устройствам путём несанкционированной установки на них:\r\nвредоносного ПО типа Backdoor для обеспечения нарушителя возможностью удалённого доступа/управления дискредитируемым вычислительным устройством;\r\nклиентского ПО для включения в ботнет и использования созданного таким образом ботнета в различных противоправных целях (рассылка спама, проведение атак типа «отказ в обслуживании» и др.).\r\nДанная угроза обусловлена уязвимостями в сетевом программном обеспечении и слабостями механизмов антивирусного контроля и межсетевого экранирования.\r\nРеализация данной угрозы возможна при условии наличия выхода с дискредитируемого вычислительного устройства в сеть Интернет","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевой узел, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":172,"Name":"Угроза распространения «почтовых червей»","Description":"Угроза заключается в возможности нарушения безопасности защищаемой информации пользователя вредоносными программами, скрытно устанавливаемыми при получении пользователями системы электронных писем, содержащих вредоносную программу типа «почтовый червь», а также невольного участия в дальнейшем противоправном распространении вредоносного кода.\r\nДанная угроза обусловлена слабостями механизмов антивирусного контроля.\r\nРеализация данной угрозы возможна при условии наличия у дискредитируемого пользователя электронного почтового ящика, а также наличия в его адресной книге хотя бы одного адреса другого пользователя","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":173,"Name":"Угроза «спама» веб-сервера","Description":"Угроза заключается в возможности неправомерного осуществления нарушителем массовой рассылки коммерческих, политических, мошеннических и иных сообщений на веб-сервер без запроса со стороны дискредитируемых веб-серверов.\r\nДанная угроза обусловлена уязвимостями механизмов фильтрации сообщений, поступающих из сети Интернет.\r\nРеализация данной угрозы возможна при условии наличия в дискредитируемом веб-сервере активированного функционала, реализующего различные почтовые сервера, службы доставки мгновенных сообщений, блоги, форумы, аукционы веб-магазинов, онлайн-сервисы отправки SMS-сообщений, онлайн-сервисы голосования и др.","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":174,"Name":"Угроза «фарминга»","Description":"Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией (в т.ч. идентификации/аутентификации) пользователя путём скрытного перенаправления пользователя на поддельный сайт (выглядящий одинаково с оригинальным), на котором от дискредитируемого пользователя требуется ввести защищаемую информацию.\r\nДанная угроза обусловлена уязвимостями DNS-сервера, маршрутизатора.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсведений о конкретных сайтах, посещаемых пользователем, на которых требуется ввод защищаемой информации;\r\nсредств создания и запуска поддельного сайта;\r\nспециальных программных средств типа «эксплойт», реализующих перенаправление пользователя на поддельный сайт.\r\nКроме того, угрозе данного типа подвержены подлинные сайты, не требующие установления безопасного соединения перед вводом информации ограниченного доступа","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Рабочая станция, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":175,"Name":"Угроза «фишинга»","Description":"Угроза заключается в возможности неправомерного ознакомления нарушителем с защищаемой информацией (в т.ч. идентификации/аутентификации) пользователя путём убеждения его с помощью методов социальной инженерии (в т.ч. посылкой целевых писем (т.н. spear-phishing attack), с помощью звонков с вопросом об открытии вложения письма, имитацией рекламных предложений (fake offers) или различных приложений (fake apps)) зайти на поддельный сайт (выглядящий одинаково с оригинальным), на котором от дискредитируемого пользователя требуется ввести защищаемую информацию или открыть заражённое вложение в письме.\r\nДанная угроза обусловлена недостаточностью знаний пользователей о методах и средствах «фишинга».\r\nРеализация данной угрозы возможна при условии наличия у нарушителя:\r\nсведений о конкретных сайтах, посещаемых пользователем, на которых требуется ввод защищаемой информации;\r\nсредств создания и запуска поддельного сайта;\r\nсведений о контактах пользователя с доверенной организацией (номер телефона, адрес электронной почты и др.).\r\nДля убеждения пользователя раскрыть информацию ограниченного доступа (или открыть вложение в письмо) наиболее часто используются поддельные письма от администрации какой-либо организации, с которой взаимодействует пользователь (например, банк)","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Рабочая станция, сетевое программное обеспечение, сетевой трафик","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2015-05-25T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":176,"Name":"Угроза нарушения технологического/производственного процесса из-за временны́х задержек, вносимых средством защиты","Description":"Угроза заключается в возможности приведения системы в состояние «отказ в обслуживании» или нарушения штатного режима функционирования из-за временной задержки в системах реального времени, вносимой в процессы передачи и обработки защищаемой информации средствами защиты информации, вызванной необходимостью обработки передаваемой/обрабатываемой информации на предмет выявления и нейтрализации угроз безопасности информации.\r\nНа реализацию данной угрозы влияет не только номенклатура применяемых средств защиты информации, параметры их настройки, объём передаваемой/обрабатываемой информации, а также текущая активность внешних нарушителей, программные воздействия которых обрабатываются средствами защиты информации","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Средство защиты информации","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":177,"Name":"Угроза неподтверждённого ввода данных оператором в систему, связанную с безопасностью","Description":"Угроза заключается в возможности возникновения ошибок в работе системы вследствие отсутствия (или игнорирования) процедуры обнаружения и исправления ошибок в данных, вводимых во время работы самим оператором, до активизации управляемого оборудования. Кроме того, к реализации данной угрозы могут привести некорректно реализованные (или отсутствующие) средства реагирования на неправильные, самопроизвольные действия оператора, средства учёта нижних/верхних пределов скорости и направления реакции оператора, схемы реагирования на двойное нажатие клавиш при вводе обычных и критических данных, процедуры формирования временных пауз с возможностью выбора разных ответов (да/нет и т.п.).\r\nРеализуемость данной угрозы зависит от требований, предъявляемых к процедурам обнаружения и исправления ошибок во вводимых данных в систему, связанную с безопасностью, а также разницей между этими требованиями и фактическим уровнем обнаружения и исправления ошибок","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение, сетевое программное обеспечение, прикладное программное обеспечение, аппаратное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":178,"Name":"Угроза несанкционированного использования системных и сетевых утилит","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на систему за счёт использования имеющихся или предварительно внедрённых стандартных (известных и обычно не определяемых антивирусными программами как вредоносных) системных и сетевых утилит, предназначенных для использования администратором для диагностики и обслуживания системы (сети).\r\nРеализация данной угрозы возможна при условиях:\r\nналичие в системе стандартных системных и сетевых утилит или успешное их внедрение нарушителем в систему и сокрытие (с использованием существующих архивов, атрибутов «скрытый» или «только для чтения» и др.);\r\nналичие у нарушителя привилегий на запуск таких утилит","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":179,"Name":"Угроза несанкционированной модификации защищаемой информации","Description":"Угроза заключается в возможности нарушения целостности защищаемой информации путём осуществления нарушителем деструктивного физического воздействия на машинный носитель информации или деструктивного программного воздействия (в т.ч. изменение отдельных бит или полное затирание информации) на данные, хранящиеся на нём.\r\nРеализация данной угрозы возможна в случае получения нарушителем системных прав на запись данных или физического доступа к машинному носителю информации на расстояние, достаточное для оказания эффективного деструктивного воздействия","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Объекты файловой системы","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":180,"Name":"Угроза отказа подсистемы обеспечения температурного режима","Description":"Угроза заключается в возможности повреждения части компонентов системы или системы в целом вследствие выхода температурного режима их работы из заданных требований из-за возникновения отказа входящих в неё подсистем вентиляции и температурных приборов.\r\nРеализация данной угрозы возможна как вследствие естественных техногенных причин, так и путём проведения определённых мероприятий нарушителем, направленных на удалённое отключение/вывод из строя компонентов подсистемы обеспечения температурного режима","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":2}],"ImpactObject":"Технические средства воздушного кондиционирования, включая трубопроводные системы для циркуляции охлаждённого воздуха в ЦОД, программируемые логические контроллеры, распределённые системы контроля, управленческие системы и другие программные средства контроля","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":181,"Name":"Угроза перехвата одноразовых паролей в режиме реального времени","Description":"Угроза заключается в возможности получения нарушителем управления критическими операциями пользователя путём перехвата одноразовых паролей, высылаемых системой автоматически, и использования их для осуществления неправомерных действий до того, как истечёт их срок действия (обычно, не более 5 минут).\r\nРеализация данной угрозы возможна при выполнении следующих условий:\r\nналичие у нарушителя сведений об информации идентификации/аутентификации дискредитируемого пользователя условно-постоянного действия;\r\nуспешное осуществление нарушителем перехвата трафика между системой и пользователем","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":182,"Name":"Угроза физического устаревания аппаратных компонентов","Description":"Угроза заключается в возможности нарушения функциональности системы, связанной с безопасностью, вследствие отказов аппаратных компонентов этой системы из-за их физического устаревания (ржавление, быстрый износ, окисление, загрязнение, отслаивание, шелушение и др.), обусловленного влиянием физической окружающей среды (влажности, пыли, коррозийных субстанций).\r\nВозможность реализации данной угрозы возрастает при использовании пользователями технических средств в условиях, не удовлетворяющих требованиям заданных их производителем","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Аппаратное средство","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2015-08-18T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":183,"Name":"Угроза перехвата управления автоматизированной системой управления технологическими процессами","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационной инфраструктуре за счёт получения нарушителем права управления входящей в её состав автоматизированной системой управления технологическими процессами путём эксплуатации уязвимостей её программного обеспечения или слабостей технологических протоколов передачи данных. \r\nДанная угроза обусловлена наличием у автоматизированной системы управления технологическими процессами программных сетевых интерфейсов взаимодействия и, как следствие, возможностью несанкционированного доступа к данной системе, а также недостаточностью мер фильтрации сетевого трафика и антивирусной защиты.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия с автоматизированной системой управления технологическими процессами. Реализация данной угрозы может привести к:\r\nблокированию или искажению (некорректность выполнения) алгоритмов отработки заданий управления технологическими процессами, непосредственного управления оборудованием предприятия;\r\nнарушению штатного хода технологических процессов;\r\nчастичному или полному останову технологических процессов без (или с) выхода(-ом) оборудования из строя;\r\nаварийной ситуации в критической системе информационной инфраструктуры","Sources":[{"violator":1,"potential":0},{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение автоматизированной системы управления технологическими процессами","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-06-23T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":184,"Name":"Угроза агрегирования данных, обрабатываемых с помощью мобильного устройства","Description":"Угроза заключается в возможности осуществления нарушителем сбора и анализа информации, обрабатываемой с помощью мобильного устройства, за счёт использования специального программного обеспечения, встраиваемого пользователем в системное программное обеспечение мобильного устройства, а также встраиваемого в мобильные программы под видом программной платформы для их разработки другими компаниями.\r\nДанная угроза обусловлена наличием в мобильном устройстве множества каналов передачи данных, а также сложностью контроля потоков информации в таком устройстве.\r\nРеализация данной угрозы возможна при условии использования мобильных устройств пользователями. В качестве собираемой информации могут выступать:\r\nперсональные данные пользователя и контактирующих с ним лиц (пол, возраст, религиозные и политические взгляды и др.);\r\nинформация ограниченного доступа (история браузера, список контактов пользователя, история звонков и др.);\r\nданные об окружающей среде (текущее местоположение мобильного устройства, маршруты движения, наличие беспроводных сетей в радиусе доступа);\r\nвидеоданные, снимаемые видеокамерами мобильного устройства;\r\nаудиоданные, снимаемые микрофоном устройства","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Мобильное устройство","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2016-06-23T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":185,"Name":"Угроза несанкционированного изменения параметров настройки средств защиты информации","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного изменения параметров настройки средства защиты информации. Данная угроза обусловлена слабостями мер разграничения доступа к конфигурационным файлам средства защиты информации. Реализация данной угрозы возможна при условии получения нарушителем прав доступа к программному интерфейсу управления средством защиты информации, а также при наличии у нарушителя сведений о структуре и формате файлов конфигурации средства защиты информации","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Средство защиты информации","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-06-23T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":186,"Name":"Угроза внедрения вредоносного кода через рекламу, сервисы и контент","Description":"Угроза заключается в возможности внедрения нарушителем в информационную систему вредоносного кода посредством рекламы, сервисов и (или) контента (т.е. убеждения пользователя системы активировать ссылку, код и др.) при посещении пользователем системы сайтов в сети Интернет или установкой программ с функцией показа рекламы.\r\nДанная угроза обусловлена слабостями механизмов фильтрации сетевого трафика и антивирусного контроля на уровне организации.\r\nРеализация данной угрозы возможна при условии посещения пользователями системы с рабочих мест сайтов в сети Интернет","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-06-23T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":187,"Name":"Угроза несанкционированного воздействия на средство защиты информации","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к программной среде управления средством защиты информации и изменения режима его функционирования.\r\nУгроза обусловлена наличием у средств защиты информации программной среды управления и взаимодействия с пользователями системы.\r\nРеализация данной угрозы возможна при условии получения нарушителем прав доступа к программному интерфейсу управления средством защиты информации","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Средство защиты информации","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":188,"Name":"Угроза подмены программного обеспечения","Description":"Угроза заключается в возможности осуществления нарушителем внедрения в систему вредоносного программного обеспечения за счёт загрузки и установки вредоносного программного обеспечения, скрытого под видом легитимного свободно распространяемого программного обеспечения.\r\nДанная угроза обусловлена наличием у пользователя прав для установки программного обеспечения из сети Интернет.\r\nРеализация данной угрозы возможна при скачивании программного обеспечения в сети Интернет","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2019-02-11T00:00:00"},{"Id":189,"Name":"Угроза маскирования действий вредоносного кода","Description":"Угроза заключается в возможности сокрытия в системе действий вредоносного кода за счет применения специальных механизмов маскирования кода (архивирование, изменение формата данных и др.), которые препятствуют его дальнейшему анализу.\r\nДанная угроза обусловлена наличием способов маскирования программного кода, не учтенных сигнатурными базами средств защиты информации, а также механизмов операционной системы, позволяющих осуществить поиск модулей средств защиты информации.\r\nРеализация данной угрозы возможна при условии использования в системе устаревших версий средств защиты информации","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Системное программное обеспечение, сетевое программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":190,"Name":"Угроза внедрения вредоносного кода за счет посещения зараженных сайтов в сети Интернет","Description":"Угроза заключается в возможности осуществления нарушителем внедрения вредоносного кода в компьютер пользователя при посещении зараженных сайтов. Нарушитель выявляет наиболее посещаемые пользователем сайты, затем их взламывает и внедряет в них вредоносный код. Данная угроза обусловлена слабостями мер антивирусной защиты, а также отсутствием правил межсетевого экранирования. Реализация данной угрозы возможна при:\r\nнеограниченном доступе пользователя в сеть Интернет;\r\nналичии у нарушителя сведений о сайтах, посещаемых пользователем","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Сетевое программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":191,"Name":"Угроза внедрения вредоносного кода в дистрибутив программного обеспечения","Description":"Угроза заключается в возможности осуществления нарушителем заражения системы путем установки недоверенного дистрибутива, в который внедрен вредоносный код. Данная угроза обусловлена слабостями мер антивирусной защиты. Реализация данной угрозы возможна при: применении пользователем сторонних дистрибутивов; отсутствии антивирусной проверки перед установкой дистрибутива","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2020-02-11T00:00:00"},{"Id":192,"Name":"Угроза использования уязвимых версий программного обеспечения","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного воздействия на систему путем эксплуатации уязвимостей программного обеспечения. Данная угроза обусловлена слабостями механизмов анализа программного обеспечения на наличие уязвимостей. Реализация данной угрозы возможна при отсутствии проверки перед применением программного обеспечения на наличие в нем уязвимостей","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Прикладное программное обеспечение, сетевое программное обеспечение, системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-10-21T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":193,"Name":"Угроза утечки информации за счет применения вредоносным программным обеспечением алгоритмов шифрования трафика","Description":"Угроза заключается в возможности утечки информации за счет применения вредоносным программным обеспечением алгоритмов шифрования трафика, скрывающих сам факт передачи данных.\r\nДанная у гроза обусловлена слабостями мер защиты информации при хранении, обработке и передаче информационных ресурсов.\r\nРеализация данной угрозы возможна: \r\nпри условии успешного внедрения в дискредитируемую систему указанного вредоносного программного обеспечения;\r\nпри отсутствии или недостаточной реализации мер межсетевого экранирования","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Информационные ресурсы, объекты файловой системы","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2016-12-01T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":194,"Name":"Угроза несанкционированного использования привилегированных функций мобильного устройства","Description":"Угроза заключается в возможности снятия нарушителем предустановленных производителем ограничений на конфигурирование привилегированных функций мобильного устройства. Данная угроза обусловлена наличием уязвимостей в операционных системах мобильного устройства, позволяющих получить доступ к настройкам привилегированных функций. \r\nРеализация данной угрозы возможна при получении нарушителем доступа к мобильному устройству","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Мобильное устройство","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2016-12-01T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":195,"Name":"Угроза удаленного запуска вредоносного кода в обход механизмов защиты операционной системы","Description":"Угроза заключается в возможности удаленного запуска вредоносного кода за счет создания приложений, использующих обход механизмов защиты, встроенных в операционную систему.\r\nДанная угроза обусловлена ошибками в процессорах (например, ошибками в процессоре Intel поколения Haswell), позволяющими за счет создания специальных приложений осуществлять обход механизмов защиты, встроенных в операционную систему (например, механизма ASLR).\r\nРеализация данной угрозы возможна при: инициировании коллизии в таблице целевых буферов - с ее помощью можно узнать участки памяти, где находятся конкретные фрагменты кода;\r\nсоздании приложения, использующего эти фрагменты кода для обхода механизма защиты;\r\nзапуске данного приложения в связке с эксплойтом какой-либо уязвимости самой операционной системы для создания возможности удаленного запуска вредоносного кода","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Стационарные и мобильные устройства (компьютеры и ноутбуки) (аппаратное устройство)","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":196,"Name":"Угроза контроля вредоносной программой списка приложений, запущенных на мобильном устройстве","Description":"Угроза заключается в возможности использования вредоносной программы для контроля списка приложений, запущенных на мобильном устройстве.\r\nДанная угроза обусловлена недостаточностью мер по антивирусной защите, что позволяет выполнить неконтролируемый запуск вредоносных программ (отсутствие контроля разрешенного программного обеспечения). Реализация данной угрозы возможна при условии, что вредоносная программа внедрена на мобильном устройстве и непреднамеренно запущена самим пользователем","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Мобильное устройство (аппаратное устройство)","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":197,"Name":"Угроза хищения аутентификационной информации из временных файлов cookie","Description":"Угроза заключается в возможности хищения с использованием вредоносной программы аутентификационной информации пользователей, их счетов, хранящейся во временных файлах cookie, и передачи этой информации нарушителям через открытый RDP-порт.\r\nДанная угроза обусловлена недостаточностью мер антивирусной защиты, что позволяет выполнить неконтролируемый запуск вредоносного программного обеспечения (отсутствие контроля разрешенного программного обеспечения).\r\nКроме того, данная угроза обусловлена непринятием мер по стиранию остаточной информации из временных файлов (очистке временных файлов).\r\nРеализация данной угрозы возможна при условии, что на атакуемом компьютере открыт RDP-порт","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Информация, хранящаяся на компьютере во временных файлах (программное обеспечение)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":198,"Name":"Угроза скрытной регистрации вредоносной программой учетных записей администраторов","Description":"Угроза заключается в возможности скрытного создания внедренной вредоносной программой учетных записей с правами администратора с целью последующего их использования для несанкционированного доступа к пользовательской информации и к настройкам программного обеспечения, установленного на инфицированном компьютере.\r\nДанная угроза обусловлена недостаточностью мер по антивирусной защите, что позволяет выполнить неконтролируемый запуск вредоносного программного обеспечения (отсутствие контроля разрешенного программного обеспечения).\r\nКроме того, данная угроза обусловлена недостаточностью мер по разграничению доступа (контроль создания учетных записей пользователей).\r\nРеализация данной угрозы возможна при условии, что на атакуемом компьютере открыт RDP-порт","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Система управления доступом, встроенная в операционную систему компьютера (программное обеспечение)","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":199,"Name":"Угроза перехвата управления мобильного устройства при использовании виртуальных голосовых ассистентов","Description":"Угроза заключается в возможности управления мобильным устройством и запущенными на нем приложениями от имени легального пользователя за счет передачи этих команд через виртуальных голосовых ассистентов (например, через Siri для IPhone).\r\nДанная угроза обусловлена проблемами аутентификации пользователя, в частности по Voice ID. Голосовой ассистент не может быть полностью уверен в том, что обращающийся к нему голос принадлежит владельцу устройства, поэтому для удобства пользователей и гарантии срабатывания устанавливается низкая чувствительность Voice ID. Это позволяет нарушителю использовать записанную на диктофон речь владельца мобильного устройства. Реализация данной угрозы возможна при условии, что виртуальный голосовой ассистент находится в активном состоянии (то есть, не отключен) и установлена низкая чувствительность голосового идентификатора","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Мобильное устройство и запущенные на  нем приложения (программное обеспечение, аппаратное устройство)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":200,"Name":"Угроза хищения информации с мобильного устройства при использовании виртуальных голосовых ассистентов","Description":"Угроза заключается в возможности хищения данных пользователя с его мобильного устройства через виртуальных голосовых ассистентов (например, через Siri для IPhone).\r\nДанная угроза обусловлена проблемами аутентификации пользователя, в частности по Voice ID. Голосовой ассистент не может быть полностью уверен в том, что обращающейся к нему голос принадлежит владельцу устройства, поэтому для удобства пользователей и гарантии срабатывания устанавливается низкая чувствительность Voice ID. Это позволяет нарушителю использовать записанную на диктофон речь владельца мобильного устройства. Реализация данной угрозы возможна при условии, что виртуальный голосовой ассистент находится в активном состоянии (то есть не отключен) и установлена низкая чувствительность голосового идентификатора","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Данные пользователя мобильного устройства (аппаратное устройство)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":201,"Name":"Угроза утечки пользовательских данных при использовании функций автоматического заполнения аутентификационной информации в браузере","Description":"Угроза заключается в возможности утечки пользовательских данных за счет использования реализованной в браузерах функции автоматического заполнение форм авторизации.\r\nРеализация данной угрозы обусловлена хранением в браузерах в открытом виде пользовательских данных, используемых для автозаполнения форм авторизации.\r\nРеализация данной угрозы возможна при условии, что пользователь использует браузер, в котором реализована и активирована функция автоматического заполнения форм авторизации","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Аутентификационные данные пользователя (программное обеспечение)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":202,"Name":"Угроза несанкционированной установки приложений на мобильные устройства","Description":"Угроза заключается в возможности установки приложений на виртуальные машины мобильных устройств, работающих под управлением операционной системы Android, несанкционированно запущенных внедренной вредоносной программой. Вредоносная программа запускает виртуальную машину на мобильном устройстве, размещает (устанавливает) в этой виртуальной машине неограниченное количество приложений.\r\nДанная угроза обусловлена недостаточностью мер по контролю за запуском прикладного программного обеспечения, что позволяет выполнить неконтролируемый запуск вредоносного прикладного программного обеспечения по факту совершения пользователем различных действий в системе (например, при попытке закрытия пользователем нежелательной рекламы).\r\nРеализация данной угрозы возможна при условии наличия на мобильном устройстве вредоносной программы, способной запустить виртуальную машину и установить в эту виртуальную машину приложение","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Мобильные устройства (аппаратное устройство, программное обеспечение)","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2017-06-07T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":203,"Name":"Угроза утечки информации с неподключенных к сети Интернет компьютеров","Description":"Угроза заключается в возможности хищения данных с неподключенных к сети Интернет компьютеров за счет компрометации их аппаратных элементов или устройств коммутационного оборудования (например, маршрутизаторов), оснащенных LED-индикаторами, фиксации мерцания этих индикаторов и расшифровки полученных результатов.\r\nРеализация данной угрозы обусловлена тем, что существует возможность несанкционированного получения управления этими индикаторами (с помощью специальной прошивки или повышения привилегий и выполнения вредоносного кода), позволяющего передавать информацию путем ее преобразования в последовательность сигналов индикаторов компьютеров и коммутационного оборудования.\r\nРеализация данной угрозы возможна при условии, что злоумышленником получен физический доступ к компрометируемому компьютеру или коммутационному оборудованию для установки средства визуального съема сигналов LED-индикаторов","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":false,"DateOfIncluding":"2017-09-01T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":204,"Name":"Угроза несанкционированного изменения вредоносной программой значений параметров программируемых логических контроллеров","Description":"Угроза заключается в возможности несанкционированного изменения вредоносной программой значений параметров контроля и управления исполнительными устройствами в программируемых логических контроллерах после ее проникновения и авторизации на данных устройствах.\r\nРеализация угрозы обусловлена возможностью вредоносной программы обнаруживать в сети программируемые логические контроллеры, проникать и функционировать в операционной системе программируемых логических контроллеров, а также недостатками механизмов аутентификации.\r\nРеализация данной угрозы возможна при условии, что существует возможность доступа к элементам автоматизированной системы управления технологическими процессами по сети Интернет","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Аппаратное устройство","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2017-09-01T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":205,"Name":"Угроза нарушения работы компьютера и блокирования доступа к его данным из-за некорректной работы установленных на нем средств защиты","Description":"Угроза заключается в возможности нарушения работы компьютера и отказа в доступе к его данным за счет ошибочного блокирования средством защиты информации файлов.\r\nРеализация данной угрозы обусловлена тем, что на компьютере установлено средство защиты информации, реализующее функцию блокирования файлов","Sources":[{"violator":1,"potential":2}],"ImpactObject":"Аппаратное устройство, программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2017-09-01T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":206,"Name":"Угроза отказа в работе оборудования из-за изменения геолокационной информации о нем","Description":"Угроза заключается в прекращении работы оборудования с ЧПУ, вызванном изменением геолокационной информации о данном оборудовании. Угроза обусловлена геолокационной привязкой оборудования с ЧПУ к конкретной географической координате при пуско-наладочных работах. Угроза реализуется при условии перемещения оборудования с ЧПУ и приводит к невозможности его дальнейшей эксплуатации","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Аппаратное устройство","BreachOfConfidentiality":true,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2017-10-30T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":207,"Name":"Угроза несанкционированного доступа к параметрам настройки оборудования за счет использования «мастер-кодов» (инженерных паролей)","Description":"Угроза заключается в несанкционированном получении доступа к параметрам настройки информации в оборудовании с ЧПУ посредством использования специальных «мастер-кодов» (инженерных паролей), «жестко прописанных» (не изменяемых путем конфигурирования) в программном обеспечении данного оборудования. Угроза обусловлена необходимостью проведения ремонтных работ при сбоях в ПО оборудования с ЧПУ представителями производителя","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Аппаратное устройство, программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2017-10-30T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":208,"Name":"Угроза нецелевого использования вычислительных ресурсов средства вычислительной техники","Description":"Угроза заключается в возможности использования вычислительных ресурсов средств вычислительной техники для осуществления сторонних вычислительных процессов.\r\nУгроза реализуется за счет внедрения в средства вычислительной техники вредоносной программы, содержащей код, реализующий использования вычислительных ресурсов для своих нужд (в частности, для майнинга криптовалюты).\r\nДанная угроза обусловлена недостаточностью следующих мер защиты информации:\r\nмер по антивирусной защите, что позволяет выполнить установку и запуск вредоносной программы;\r\nмер по ограничению программной среды, что позволяют нарушителю осуществлять бесконтрольный запуск программных компонентов.","Sources":[{"violator":1,"potential":2},{"violator":1,"potential":1},{"violator":0,"potential":2},{"violator":0,"potential":1}],"ImpactObject":"Средство вычислительной техники, мобильное устройство","BreachOfConfidentiality":false,"BreachOfIntegrity":false,"BreachOfAvailability":true,"DateOfIncluding":"2018-04-10T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":209,"Name":"Угроза несанкционированного доступа к защищаемой памяти \r\nядра процессора","Description":"Угроза заключается в возможности получения доступа к защищенной памяти из программы, не обладающей соответствующими правами, в результате эксплуатации уязвимостей, позволяющих преодолеть механизм разграничения доступа, реализуемый центральным процессором.\r\nРеализация данной угрозы обусловлена наличием уязвимостей, связанных с ошибкой контроля доступа к памяти, основанных на спекулятивном выполнении инструкций процессора. Ошибка контроля доступа обусловлена следующими факторами:\r\n1) отсутствие проверки прав доступа процесса к читаемым областям при спекулятивном выполнении операций, в том числе при чтении из оперативной памяти;\r\n2) отсутствие очистки кэша от результатов ошибочного спекулятивного исполнения;\r\n3) хранение данных ядра операционной системы в адресном пространстве процесса.\r\nРеализация данной угрозы возможна из-за наличия процессоров, имеющих аппаратные уязвимости и отсутствия соответствующих обновлений","Sources":[{"violator":1,"potential":2},{"violator":0,"potential":2}],"ImpactObject":"Аппаратное устройство","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2018-06-13T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":210,"Name":"Угроза нарушения работы информационной системы, вызванного обновлением используемого в ней программного обеспечения","Description":"Угроза заключается в возможном нарушении функционирования программных, программно-аппаратных элементов информационной системы или информационной системы в целом из-за некорректной работы установленных обновлений (патчей) системного программного обеспечения.\r\nУгроза обусловлена наличием критических ошибок, дефектов, уязвимостей в используемом программном обеспечении информационной системы.\r\nРеализация данной угрозы возможна при условии установки обновлений на программно-аппаратные компоненты информационной системы","Sources":[{"violator":0,"potential":0}],"ImpactObject":"Аппаратное устройство, микропрограммное, системное и прикладное программное обеспечение","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2018-11-19T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":211,"Name":"Угроза использования непроверенных пользовательских данных при формировании конфигурационного файла, используемого программным обеспечением администрирования информационных систем","Description":"Угроза заключается в возможности деструктивного воздействия на информационную систему и обрабатываемую ею информацию в результате работы программного обеспечения, используемого для администрирования информационных систем.\r\nДанная угроза связана со слабостями процедуры проверки пользовательских данных, используемых при формировании конфигурационного файла для программного обеспечения администрирования информационных систем.\r\nРеализация данной угрозы возможна в случае, если в информационной системе используется программное обеспечение администрирования информационных систем, которое в качестве исходных данных использует конфигурационные файлы, сформированные на основе пользовательских данных","Sources":[{"violator":0,"potential":2}],"ImpactObject":"Системное программное обеспечение","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":false,"DateOfIncluding":"2018-11-19T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":212,"Name":"Угроза перехвата управления информационной системой","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к информационным, программным и вычислительным ресурсам информационной системы в результате подмены средств централизованного управления информационной системой или её компонентами.\r\nДанная угроза обусловлена наличием у средств централизованного управления программных интерфейсов взаимодействия с другими субъектами доступа (процессами, программами) и, как следствие, возможностью несанкционированного доступа к данным средствам централизованного управления, а также недостаточностью мер по разграничению доступа к ним.\r\nРеализация данной угрозы возможна при условии наличия у нарушителя прав на осуществление взаимодействия со средствами централизованного управления","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Инфраструктура информационных систем","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2018-11-19T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":213,"Name":"Угроза обхода многофакторной аутентификации","Description":"Угроза заключается в возможности обхода многофакторной аутентификации путем внедрения вредоносного кода в дискредитируемую систему и компоненты, участвующие в процедуре многофакторной аутентификации.\r\nДанная угроза обусловлена:\r\nналичием уязвимостей программного обеспечения;\r\nслабостями мер антивирусной защиты и разграничения доступа.\r\nРеализация данной угрозы возможна:\r\nв случае работы дискредитируемого пользователя с файлами, поступающими из недоверенных источников;\r\nпри наличии у него привилегий установки программного обеспечения","Sources":[{"violator":1,"potential":0}],"ImpactObject":"Системное программное обеспечение, микропрограммное обеспечение, учетные данные пользователя","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2018-11-19T00:00:00","DateOfLastChange":"2019-02-08T00:00:00"},{"Id":214,"Name":"Угроза несвоевременного выявления и реагирования компонентами информационной (автоматизированной) системы (в том числе средствами защиты информации) на события безопасности информации","Description":"Угроза заключается в пропуске и/или значительной временной задержке определения (выявления) событий безопасности информации, что приводит к отсутствию реакции на попытки несанкционированного доступа в информационную (автоматизированную) систему, на внедрение вредоносных программ.\r\nДанная угроза обусловлена некорректной настройкой компонентов информационной (автоматизированной) системы и/или средств защиты информации, а также отсутствием таких компонентов и/или средств защиты информации.\r\nРеализация данной угрозы возможна при отсутствии мер защиты, связанных с мониторингом, сбором и анализом данных о событиях информационной безопасности (отсутствием мер регистрации событий безопасности)","Sources":[{"violator":0,"potential":1}],"ImpactObject":"Программное обеспечение, каналы связи (передачи) данных","BreachOfConfidentiality":false,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2019-11-15T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":215,"Name":"Угроза несанкционированного доступа к системе при помощи сторонних сервисов","Description":"Угроза заключается в возможности осуществления нарушителем деструктивного программного воздействия на дискредитируемую систему с использованием сторонних легитимных сервисов (социальных сетей, мессенджеров, репозиториев кода и т.п.), используемых в качестве посредника.\r\nРеализация данной угрозы возможна если дискредитируемая система уже скомпрометирована.","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Программное обеспечение (программы)","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2019-11-15T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":216,"Name":"Угроза получения несанкционированного доступа к приложениям, установленным на Smart-картах","Description":"Угроза заключается в возможности осуществления нарушителем несанкционированного доступа к приложениям, установленным на Smart-картах путем отправки специально сформированных команд управления (например, специально сформированных SMS-сообщений, отправленных на SIM-карту).\r\nДанная угроза обусловлена наличием уязвимостей в приложениях, устанавливаемых на Smart-карты.\r\nРеализация данной угрозы возможна при использовании Smart-карт типа Java Card","Sources":[{"violator":1,"potential":1}],"ImpactObject":"Программное обеспечение (программы)","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2019-11-15T00:00:00","DateOfLastChange":"2019-11-15T00:00:00"},{"Id":217,"Name":"Угроза использования скомпрометированного доверенного источника обновлений программного обеспечения","Description":"Угроза заключается в возможности внедрения вредоносного кода в информационную систему за счет использования скомпрометированных доверенных источников обновлений программного обеспечения.\r\nРеализация данной угрозы возможна при использовании скомпрометированных доверенных серверов обновлений программного обеспечения","Sources":[{"violator":1,"potential":1},{"violator":0,"potential":1}],"ImpactObject":"Информационная система, файлы","BreachOfConfidentiality":true,"BreachOfIntegrity":true,"BreachOfAvailability":true,"DateOfIncluding":"2020-02-11T00:00:00","DateOfLastChange":"2020-02-11T00:00:00"}]